1) /srv/app/src/Core/Customer/Application/CommandHandler/CreateCustomerCommandHandler.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __invoke(CreateCustomerCommand $command) : void
     {
-        $this->repository->save($command->customer);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\CreateCustomerCommandHandlerTest::testInvokeSavesCustomer
  Expectation failed for method name is "save" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

2) /srv/app/src/Core/Customer/Application/CommandHandler/CreateStatusCommandHandler.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __invoke(CreateStatusCommand $command) : void
     {
-        $this->repository->save($command->status);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\CreateStatusCommandHandlerTest::testInvokeSavesStatus
  Expectation failed for method name is "save" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

3) /srv/app/src/Core/Customer/Application/CommandHandler/CreateTypeCommandHandler.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __invoke(CreateTypeCommand $command) : void
     {
-        $this->repository->save($command->type);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\CreateTypeCommandHandlerTest::testInvokeSavesType
  Expectation failed for method name is "save" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

4) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customer = $command->customer;
         $updateData = $command->updateData;
-        $customer->setInitials($updateData->newInitials);
+        
         $customer->setEmail($updateData->newEmail);
         $customer->setPhone($updateData->newPhone);
         $customer->setLeadSource($updateData->newLeadSource);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setInitials" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

5) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer = $command->customer;
         $updateData = $command->updateData;
         $customer->setInitials($updateData->newInitials);
-        $customer->setEmail($updateData->newEmail);
+        
         $customer->setPhone($updateData->newPhone);
         $customer->setLeadSource($updateData->newLeadSource);
         $customer->setType($updateData->newType);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setEmail" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

6) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $updateData = $command->updateData;
         $customer->setInitials($updateData->newInitials);
         $customer->setEmail($updateData->newEmail);
-        $customer->setPhone($updateData->newPhone);
+        
         $customer->setLeadSource($updateData->newLeadSource);
         $customer->setType($updateData->newType);
         $customer->setStatus($updateData->newStatus);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setPhone" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

7) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer->setInitials($updateData->newInitials);
         $customer->setEmail($updateData->newEmail);
         $customer->setPhone($updateData->newPhone);
-        $customer->setLeadSource($updateData->newLeadSource);
+        
         $customer->setType($updateData->newType);
         $customer->setStatus($updateData->newStatus);
         $customer->setConfirmed($updateData->newConfirmed);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setLeadSource" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

8) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer->setEmail($updateData->newEmail);
         $customer->setPhone($updateData->newPhone);
         $customer->setLeadSource($updateData->newLeadSource);
-        $customer->setType($updateData->newType);
+        
         $customer->setStatus($updateData->newStatus);
         $customer->setConfirmed($updateData->newConfirmed);
         $this->repository->save($customer);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setType" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

9) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer->setPhone($updateData->newPhone);
         $customer->setLeadSource($updateData->newLeadSource);
         $customer->setType($updateData->newType);
-        $customer->setStatus($updateData->newStatus);
+        
         $customer->setConfirmed($updateData->newConfirmed);
         $this->repository->save($customer);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setStatus" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

10) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer->setLeadSource($updateData->newLeadSource);
         $customer->setType($updateData->newType);
         $customer->setStatus($updateData->newStatus);
-        $customer->setConfirmed($updateData->newConfirmed);
+        
         $this->repository->save($customer);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "setConfirmed" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

11) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateCustomerCommandHandler.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer->setType($updateData->newType);
         $customer->setStatus($updateData->newStatus);
         $customer->setConfirmed($updateData->newConfirmed);
-        $this->repository->save($customer);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.056, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerCommandHandlerTest::testInvokeUpdatesAndSavesCustomer
  Expectation failed for method name is "save" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

12) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateStatusCommandHandler.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __invoke(UpdateCustomerStatusCommand $command) : void
     {
-        $command->customerStatus->setValue($command->update->value);
+        
         $this->repository->save($command->customerStatus);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerStatusCommandHandlerTest::testInvoke
  Expectation failed for method name is "setValue" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

13) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateStatusCommandHandler.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __invoke(UpdateCustomerStatusCommand $command) : void
     {
         $command->customerStatus->setValue($command->update->value);
-        $this->repository->save($command->customerStatus);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerStatusCommandHandlerTest::testInvoke
  Expectation failed for method name is "save" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

14) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateTypeCommandHandler.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function __invoke(UpdateCustomerTypeCommand $command) : void
     {
-        $command->customerType->setValue($command->update->value);
+        
         $this->repository->save($command->customerType);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerTypeCommandHandlerTest::testInvoke
  Expectation failed for method name is "setValue" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

15) /srv/app/src/Core/Customer/Application/CommandHandler/UpdateTypeCommandHandler.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __invoke(UpdateCustomerTypeCommand $command) : void
     {
         $command->customerType->setValue($command->update->value);
-        $this->repository->save($command->customerType);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\CommandHandler\UpdateCustomerTypeCommandHandlerTest::testInvoke
  Expectation failed for method name is "save" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

16) /srv/app/src/Core/Customer/Application/Factory/CustomerUpdateFactory.php:43    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $customerType = $this->relationResolver->resolveType($input['type'] ?? null, $customer);
         $customerStatus = $this->relationResolver->resolveStatus($input['status'] ?? null, $customer);
-        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
+        return new CustomerUpdate($customer->getInitials() ?? $input['initials'], $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Factory\CustomerUpdateFactoryTest::testCreateWithAllFieldsProvided
  Failed asserting that two strings are identical.
  --- Expected
  +++ Actual
  @@ @@
  -'AB'
  +''
  
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:114
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

17) /srv/app/src/Core/Customer/Application/Factory/CustomerUpdateFactory.php:44    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $customerType = $this->relationResolver->resolveType($input['type'] ?? null, $customer);
         $customerStatus = $this->relationResolver->resolveStatus($input['status'] ?? null, $customer);
-        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
+        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $customer->getEmail() ?? $input['email'], $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Factory\CustomerUpdateFactoryTest::testCreateWithAllFieldsProvided
  Failed asserting that two strings are identical.
  --- Expected
  +++ Actual
  @@ @@
  -'denesik.jacky@cassin.com'
  +''
  
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:115
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 3, Failures: 1.

18) /srv/app/src/Core/Customer/Application/Factory/CustomerUpdateFactory.php:45    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $customerType = $this->relationResolver->resolveType($input['type'] ?? null, $customer);
         $customerStatus = $this->relationResolver->resolveStatus($input['status'] ?? null, $customer);
-        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
+        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $customer->getPhone() ?? $input['phone'], $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Factory\CustomerUpdateFactoryTest::testCreateWithAllFieldsProvided
  Failed asserting that two strings are identical.
  --- Expected
  +++ Actual
  @@ @@
  -'+1.308.414.0994'
  +''
  
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:116
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 4, Failures: 1.

19) /srv/app/src/Core/Customer/Application/Factory/CustomerUpdateFactory.php:46    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $customerType = $this->relationResolver->resolveType($input['type'] ?? null, $customer);
         $customerStatus = $this->relationResolver->resolveStatus($input['status'] ?? null, $customer);
-        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
+        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $customer->getLeadSource() ?? $input['leadSource'], $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Factory\CustomerUpdateFactoryTest::testCreateWithAllFieldsProvided
  Failed asserting that two strings are identical.
  --- Expected
  +++ Actual
  @@ @@
  -'website'
  +''
  
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:117
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 5, Failures: 1.

20) /srv/app/src/Core/Customer/Application/Factory/CustomerUpdateFactory.php:49    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $customerType = $this->relationResolver->resolveType($input['type'] ?? null, $customer);
         $customerStatus = $this->relationResolver->resolveStatus($input['status'] ?? null, $customer);
-        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $input['confirmed'] ?? $customer->isConfirmed());
+        return new CustomerUpdate($input['initials'] ?? $customer->getInitials(), $input['email'] ?? $customer->getEmail(), $input['phone'] ?? $customer->getPhone(), $input['leadSource'] ?? $customer->getLeadSource(), $customerType, $customerStatus, $customer->isConfirmed() ?? $input['confirmed']);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Factory\CustomerUpdateFactoryTest::testCreateWithAllFieldsProvided
  Failed asserting that false is true.
  
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:120
  /srv/app/tests/Unit/Customer/Application/Factory/CustomerUpdateFactoryTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 8, Failures: 1.

21) /srv/app/src/Core/Customer/Application/Processor/CreateCustomerProcessor.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customerTypeEntity = $this->iriConverter->getResourceFromIri($data->type);
         $customer = $this->transformer->transform($data->initials, $data->email, $data->phone, $data->leadSource, $customerTypeEntity, $customerStatusEntity, $data->confirmed);
         $command = $this->createCustomerFactory->create($customer);
-        $this->commandBus->dispatch($command);
+        
         return $command->customer;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.061, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Processor\CreateCustomerProcessorTest::testProcessCreatesAndDispatchesCommand
  Expectation failed for method name is "dispatch" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

22) /srv/app/src/Core/Customer/Application/Processor/CreateStatusProcessor.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customerStatus = $this->transformer->transform($data->value);
         $command = $this->statusCommandFactory->create($customerStatus);
-        $this->commandBus->dispatch($command);
+        
         return $customerStatus;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CreateStatusProcessorTest::testProcessCreatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\CreateStatusCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CreateStatusProcessorTest.php:48
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

23) /srv/app/src/Core/Customer/Application/Processor/CreateTypeProcessor.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customerType = $this->transformer->transform($data->value);
         $command = $this->createTypeCommandFactory->create($customerType);
-        $this->commandBus->dispatch($command);
+        
         return $customerType;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CreateTypeProcessorTest::testProcessTransformsCreatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\CreateTypeCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CreateTypeProcessorTest.php:44
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

24) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customer = $this->retrieveCustomer($uriVariables);
         $customerUpdate = $this->prepareCustomerUpdate($data, $customer);
-        $this->dispatchUpdateCommand($customer, $customerUpdate);
+        
         return $customer;
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.056, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

25) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:58    [M] Coalesce

--- Original
+++ New
@@ @@
     private function retrieveCustomer(array $uriVariables) : Customer
     {
         $ulid = $uriVariables['ulid'];
-        return $this->repository->find($this->ulidTransformer->create($ulid)) ?? throw new CustomerNotFoundException();
+        return throw new CustomerNotFoundException() ?? $this->repository->find($this->ulidTransformer->create($ulid));
     }
     private function prepareCustomerUpdate(CustomerPatch $data, Customer $customer) : CustomerUpdate
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

26) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:73    [M] Coalesce

--- Original
+++ New
@@ @@
         $newLeadSource = $this->updateLeadSource($data, $customer);
         $newType = $this->updateType($data, $customer);
         $newStatus = $this->updateStatus($data, $customer);
-        $newConfirmed = $data->confirmed ?? $customer->isConfirmed();
+        $newConfirmed = $customer->isConfirmed() ?? $data->confirmed;
         return new CustomerUpdate(newInitials: $newInitials, newEmail: $newEmail, newPhone: $newPhone, newLeadSource: $newLeadSource, newType: $newType, newStatus: $newStatus, newConfirmed: $newConfirmed);
     }
     private function updateInitials(CustomerPatch $data, Customer $customer) : string

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

27) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:130    [M] Ternary

--- Original
+++ New
@@ @@
     }
     private function updateType(CustomerPatch $data, Customer $customer) : CustomerType
     {
-        return $data->type ? $this->getCustomerType($data->type) : $customer->getType();
+        return $data->type ? $customer->getType() : $this->getCustomerType($data->type);
     }
     private function updateStatus(CustomerPatch $data, Customer $customer) : CustomerStatus
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
