28) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:139    [M] Ternary

--- Original
+++ New
@@ @@
     }
     private function updateStatus(CustomerPatch $data, Customer $customer) : CustomerStatus
     {
-        return $data->status ? $this->getCustomerStatus($data->status) : $customer->getStatus();
+        return $data->status ? $customer->getStatus() : $this->getCustomerStatus($data->status);
     }
     private function dispatchUpdateCommand(Customer $customer, CustomerUpdate $update) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

29) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:148    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function dispatchUpdateCommand(Customer $customer, CustomerUpdate $update) : void
     {
-        $this->commandBus->dispatch($this->commandFactory->create($customer, $update));
+        
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

30) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:157    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string
     {
-        return strlen(trim($newValue ?? '')) > 0 ? $newValue : $defaultValue;
+        return strlen($newValue ?? '') > 0 ? $newValue : $defaultValue;
     }
     private function getCustomerType(string $typeIri) : CustomerType
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

31) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:157    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string
     {
-        return strlen(trim($newValue ?? '')) > 0 ? $newValue : $defaultValue;
+        return strlen(trim($newValue ?? '')) >= 0 ? $newValue : $defaultValue;
     }
     private function getCustomerType(string $typeIri) : CustomerType
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

32) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:157    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string
     {
-        return strlen(trim($newValue ?? '')) > 0 ? $newValue : $defaultValue;
+        return strlen(trim('' ?? $newValue)) > 0 ? $newValue : $defaultValue;
     }
     private function getCustomerType(string $typeIri) : CustomerType
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.061, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

33) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:157    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string
     {
-        return strlen(trim($newValue ?? '')) > 0 ? $newValue : $defaultValue;
+        return strlen(trim($newValue ?? '')) <= 0 ? $newValue : $defaultValue;
     }
     private function getCustomerType(string $typeIri) : CustomerType
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.067, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

34) /srv/app/src/Core/Customer/Application/Processor/CustomerPatchProcessor.php:157    [M] Ternary

--- Original
+++ New
@@ @@
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string
     {
-        return strlen(trim($newValue ?? '')) > 0 ? $newValue : $defaultValue;
+        return strlen(trim($newValue ?? '')) > 0 ? $defaultValue : $newValue;
     }
     private function getCustomerType(string $typeIri) : CustomerType
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.065, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:271
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPatchProcessorTest.php:54
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

35) /srv/app/src/Core/Customer/Application/Processor/CustomerPutProcessor.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer = $this->retrieveCustomer($uriVariables['ulid']);
         $customerType = $this->convertResource($data->type);
         $customerStatus = $this->convertResource($data->status);
-        $this->executeUpdateCommand($customer, $data, $customerType, $customerStatus);
+        
         return $customer;
     }
     private function retrieveCustomer(string $customerId) : Customer

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPutProcessorTest.php:65
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

36) /srv/app/src/Core/Customer/Application/Processor/CustomerPutProcessor.php:57    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function retrieveCustomer(string $customerId) : Customer
     {
         $customer = $this->customerRepository->find($customerId);
-        if (!$customer) {
+        if ($customer) {
             throw new CustomerNotFoundException();
         }
         return $customer;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPutProcessorTest.php:65
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

37) /srv/app/src/Core/Customer/Application/Processor/CustomerPutProcessor.php:58    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $customer = $this->customerRepository->find($customerId);
         if (!$customer) {
-            throw new CustomerNotFoundException();
+            new CustomerNotFoundException();
         }
         return $customer;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPutProcessorTest.php:65
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

38) /srv/app/src/Core/Customer/Application/Processor/CustomerPutProcessor.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customerUpdate = new CustomerUpdate($data->initials, $data->email, $data->phone, $data->leadSource, $customerType, $customerStatus, $data->confirmed);
         $command = $this->updateCommandFactory->create($customer, $customerUpdate);
-        $this->commandBus->dispatch($command);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerPutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Application\Command\UpdateCustomerCommand" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerPutProcessorTest.php:65
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

39) /srv/app/src/Core/Customer/Application/Processor/CustomerStatusPatchProcessor.php:43    [M] Coalesce

--- Original
+++ New
@@ @@
     public function process(mixed $data, Operation $operation, array $uriVariables = [], array $context = []) : CustomerStatus
     {
         $ulid = $uriVariables['ulid'];
-        $customerStatus = $this->repository->find($this->ulidFactory->create($ulid)) ?? throw new CustomerStatusNotFoundException();
+        $customerStatus = throw new CustomerStatusNotFoundException() ?? $this->repository->find($this->ulidFactory->create($ulid));
         $newValue = $this->getNewValue($data->value, $customerStatus->getValue());
         $this->dispatchCommand($customerStatus, $newValue);
         return $customerStatus;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerStatusPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerStatusPatchProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

40) /srv/app/src/Core/Customer/Application/Processor/CustomerStatusPatchProcessor.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $ulid = $uriVariables['ulid'];
         $customerStatus = $this->repository->find($this->ulidFactory->create($ulid)) ?? throw new CustomerStatusNotFoundException();
         $newValue = $this->getNewValue($data->value, $customerStatus->getValue());
-        $this->dispatchCommand($customerStatus, $newValue);
+        
         return $customerStatus;
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerStatusPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerStatusPatchProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

46) /srv/app/src/Core/Customer/Application/Processor/CustomerStatusPatchProcessor.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function dispatchCommand(CustomerStatus $customerStatus, string $value) : void
     {
-        $this->commandBus->dispatch($this->commandFactory->create($customerStatus, new CustomerStatusUpdate($value)));
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerStatusPatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerStatusPatchProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

48) /srv/app/src/Core/Customer/Application/Processor/CustomerStatusPutProcessor.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $ulid = $uriVariables['ulid'];
         $customerStatus = $this->repository->find($this->ulidFactory->create($ulid)) ?? throw new CustomerStatusNotFoundException();
-        $this->dispatchCommand($customerStatus, $data->value);
+        
         return $customerStatus;
     }
     private function dispatchCommand(CustomerStatus $customerStatus, string $value) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerStatusPutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerStatusPutProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

50) /srv/app/src/Core/Customer/Application/Processor/CustomerTypePatchProcessor.php:43    [M] Coalesce

--- Original
+++ New
@@ @@
     public function process(mixed $data, Operation $operation, array $uriVariables = [], array $context = []) : CustomerType
     {
         $ulid = $uriVariables['ulid'];
-        $customerType = $this->repository->find($this->ulidFactory->create($ulid)) ?? throw new CustomerTypeNotFoundException();
+        $customerType = throw new CustomerTypeNotFoundException() ?? $this->repository->find($this->ulidFactory->create($ulid));
         $newValue = $this->getNewValue($data->value, $customerType->getValue());
         $this->dispatchCommand($customerType, $newValue);
         return $customerType;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerTypePatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerTypePatchProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

51) /srv/app/src/Core/Customer/Application/Processor/CustomerTypePatchProcessor.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $ulid = $uriVariables['ulid'];
         $customerType = $this->repository->find($this->ulidFactory->create($ulid)) ?? throw new CustomerTypeNotFoundException();
         $newValue = $this->getNewValue($data->value, $customerType->getValue());
-        $this->dispatchCommand($customerType, $newValue);
+        
         return $customerType;
     }
     private function getNewValue(?string $newValue, string $defaultValue) : string

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerTypePatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerTypePatchProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

57) /srv/app/src/Core/Customer/Application/Processor/CustomerTypePatchProcessor.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function dispatchCommand(CustomerType $customerType, string $newValue) : void
     {
-        $this->commandBus->dispatch($this->commandFactory->create($customerType, new CustomerTypeUpdate($newValue)));
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerTypePatchProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerTypePatchProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

58) /srv/app/src/Core/Customer/Application/Processor/CustomerTypePutProcessor.php:43    [M] Coalesce

--- Original
+++ New
@@ @@
     public function process(mixed $data, Operation $operation, array $uriVariables = [], array $context = []) : CustomerType
     {
         $ulid = $uriVariables['ulid'];
-        $customerType = $this->repository->find($this->ulidTransformer->create($ulid)) ?? throw new CustomerTypeNotFoundException();
+        $customerType = throw new CustomerTypeNotFoundException() ?? $this->repository->find($this->ulidTransformer->create($ulid));
         $this->dispatchCommand($customerType, $data->value);
         return $customerType;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerTypePutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerTypePutProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

59) /srv/app/src/Core/Customer/Application/Processor/CustomerTypePutProcessor.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $ulid = $uriVariables['ulid'];
         $customerType = $this->repository->find($this->ulidTransformer->create($ulid)) ?? throw new CustomerTypeNotFoundException();
-        $this->dispatchCommand($customerType, $data->value);
+        
         return $customerType;
     }
     private function dispatchCommand(CustomerType $customerType, string $newValue) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Processor\CustomerTypePutProcessorTest::testProcessUpdatesAndDispatchesCommand
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Processor/CustomerTypePutProcessorTest.php:37
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

61) /srv/app/src/Core/Customer/Application/Resolver/CreateCustomerMutationResolver.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
          */
         $input = $context['args']['input'];
         $mutationInput = $this->inputMapper->transform($input);
-        $this->validator->validate($mutationInput);
+        
         $customerStatusEntity = $this->iriConverter->getResourceFromIri($input['status']);
         $customerTypeEntity = $this->iriConverter->getResourceFromIri($input['type']);
         $customer = $this->builder->transform($input['initials'], $input['email'], $input['phone'], $input['leadSource'], $customerTypeEntity, $customerStatusEntity, $input['confirmed']);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\CreateCustomerMutationResolverTest::testInvokeCreatesCustomer
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateCustomerMutationResolverTest.php:57
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

62) /srv/app/src/Core/Customer/Application/Resolver/CreateCustomerMutationResolver.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customerTypeEntity = $this->iriConverter->getResourceFromIri($input['type']);
         $customer = $this->builder->transform($input['initials'], $input['email'], $input['phone'], $input['leadSource'], $customerTypeEntity, $customerStatusEntity, $input['confirmed']);
         $command = $this->factory->create($customer);
-        $this->commandBus->dispatch($command);
+        
         return $command->customer;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\CreateCustomerMutationResolverTest::testInvokeCreatesCustomer
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateCustomerMutationResolverTest.php:57
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

63) /srv/app/src/Core/Customer/Application/Resolver/CreateStatusMutationResolver.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         /** @var array{value: string} $input */
         $input = $context['args']['input'];
         $mutationInput = $this->inputs->transform($input);
-        $this->validator->validate($mutationInput);
+        
         $customerStatus = $this->statusBuilder->transform($input['value']);
         $command = $this->factory->create($customerStatus);
         $this->commandBus->dispatch($command);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\CreateStatusMutationResolverTest::testInvokeCreatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateStatusMutationResolverTest.php:41
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateStatusMutationResolverTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

64) /srv/app/src/Core/Customer/Application/Resolver/CreateStatusMutationResolver.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->validator->validate($mutationInput);
         $customerStatus = $this->statusBuilder->transform($input['value']);
         $command = $this->factory->create($customerStatus);
-        $this->commandBus->dispatch($command);
+        
         return $customerStatus;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\CreateStatusMutationResolverTest::testInvokeCreatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateStatusMutationResolverTest.php:41
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateStatusMutationResolverTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

65) /srv/app/src/Core/Customer/Application/Resolver/CreateTypeMutationResolver.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         /** @var array{value: string} $input */
         $input = $context['args']['input'];
         $mutationInput = $this->inputTransformer->transform($input);
-        $this->validator->validate($mutationInput);
+        
         $customerType = $this->typeBuilder->transform($input['value']);
         $command = $this->factory->create($customerType);
         $this->commandBus->dispatch($command);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\CreateTypeMutationResolverTest::testInvokeCreatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateTypeMutationResolverTest.php:41
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateTypeMutationResolverTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

66) /srv/app/src/Core/Customer/Application/Resolver/CreateTypeMutationResolver.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->validator->validate($mutationInput);
         $customerType = $this->typeBuilder->transform($input['value']);
         $command = $this->factory->create($customerType);
-        $this->commandBus->dispatch($command);
+        
         return $customerType;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\CreateTypeMutationResolverTest::testInvokeCreatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateTypeMutationResolverTest.php:41
  /srv/app/tests/Unit/Customer/Application/Resolver/CreateTypeMutationResolverTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
