68) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $customer = $this->findCustomer($item, $input['id']);
         $customerUpdate = $this->updateFactory->create($customer, $input);
         $command = $this->commandFactory->create($customer, $customerUpdate);
-        $this->commandBus->dispatch($command);
+        
         return $customer;
     }
     private function findCustomer(?object $item, string $id) : Customer

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

69) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:74    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     private function findCustomer(?object $item, string $id) : Customer
     {
-        if ($item instanceof Customer) {
+        if (true) {
             return $item;
         }
         $ulid = $this->extractUlid($id);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

70) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:74    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     private function findCustomer(?object $item, string $id) : Customer
     {
-        if ($item instanceof Customer) {
+        if (false) {
             return $item;
         }
         $ulid = $this->extractUlid($id);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

71) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:81    [M] InstanceOf_

--- Original
+++ New
@@ @@
         }
         $ulid = $this->extractUlid($id);
         $customer = $this->repository->find($ulid);
-        if (!$customer instanceof Customer) {
+        if (!true) {
             throw CustomerNotFoundException::withId($id);
         }
         return $customer;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

72) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:81    [M] InstanceOf_

--- Original
+++ New
@@ @@
         }
         $ulid = $this->extractUlid($id);
         $customer = $this->repository->find($ulid);
-        if (!$customer instanceof Customer) {
+        if (!false) {
             throw CustomerNotFoundException::withId($id);
         }
         return $customer;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

73) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:81    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         $ulid = $this->extractUlid($id);
         $customer = $this->repository->find($ulid);
-        if (!$customer instanceof Customer) {
+        if ($customer instanceof Customer) {
             throw CustomerNotFoundException::withId($id);
         }
         return $customer;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

74) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:82    [M] Throw_

--- Original
+++ New
@@ @@
         $ulid = $this->extractUlid($id);
         $customer = $this->repository->find($ulid);
         if (!$customer instanceof Customer) {
-            throw CustomerNotFoundException::withId($id);
+            CustomerNotFoundException::withId($id);
         }
         return $customer;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

75) /srv/app/src/Core/Customer/Application/Resolver/UpdateCustomerMutationResolver.php:93    [M] Ternary

--- Original
+++ New
@@ @@
      */
     private function extractUlid(string $idOrIri) : string
     {
-        return str_starts_with($idOrIri, '/') ? basename($idOrIri) : $idOrIri;
+        return str_starts_with($idOrIri, '/') ? $idOrIri : basename($idOrIri);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

77) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:45    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $input = $context['args']['input'];
         $mutationInput = $this->inputs->transform($input);
         $this->validator->validate($mutationInput);
-        $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
+        $customerStatus = true ? $item : $this->repository->find($this->extractUlid($input['id']));
         if (!$customerStatus instanceof CustomerStatus) {
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

78) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:45    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $input = $context['args']['input'];
         $mutationInput = $this->inputs->transform($input);
         $this->validator->validate($mutationInput);
-        $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
+        $customerStatus = false ? $item : $this->repository->find($this->extractUlid($input['id']));
         if (!$customerStatus instanceof CustomerStatus) {
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

79) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:45    [M] Ternary

--- Original
+++ New
@@ @@
         $input = $context['args']['input'];
         $mutationInput = $this->inputs->transform($input);
         $this->validator->validate($mutationInput);
-        $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
+        $customerStatus = $item instanceof CustomerStatus ? $this->repository->find($this->extractUlid($input['id'])) : $item;
         if (!$customerStatus instanceof CustomerStatus) {
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

80) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:49    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $mutationInput = $this->inputs->transform($input);
         $this->validator->validate($mutationInput);
         $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
-        if (!$customerStatus instanceof CustomerStatus) {
+        if (!true) {
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerStatus, new CustomerValueObject\CustomerStatusUpdate($input['value']));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

81) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:49    [M] LogicalNot

--- Original
+++ New
@@ @@
         $mutationInput = $this->inputs->transform($input);
         $this->validator->validate($mutationInput);
         $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
-        if (!$customerStatus instanceof CustomerStatus) {
+        if ($customerStatus instanceof CustomerStatus) {
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerStatus, new CustomerValueObject\CustomerStatusUpdate($input['value']));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

82) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:49    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $mutationInput = $this->inputs->transform($input);
         $this->validator->validate($mutationInput);
         $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
-        if (!$customerStatus instanceof CustomerStatus) {
+        if (!false) {
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerStatus, new CustomerValueObject\CustomerStatusUpdate($input['value']));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

83) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:50    [M] Throw_

--- Original
+++ New
@@ @@
         $this->validator->validate($mutationInput);
         $customerStatus = $item instanceof CustomerStatus ? $item : $this->repository->find($this->extractUlid($input['id']));
         if (!$customerStatus instanceof CustomerStatus) {
-            throw CustomerStatusNotFoundException::withIri($input['id']);
+            CustomerStatusNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerStatus, new CustomerValueObject\CustomerStatusUpdate($input['value']));
         $this->commandBus->dispatch($command);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

84) /srv/app/src/Core/Customer/Application/Resolver/UpdateStatusMutationResolver.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw CustomerStatusNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerStatus, new CustomerValueObject\CustomerStatusUpdate($input['value']));
-        $this->commandBus->dispatch($command);
+        
         return $customerStatus;
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

87) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:45    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $input = $context['args']['input'];
         $mutationInput = $this->inputTransformer->transform($input);
         $this->validator->validate($mutationInput);
-        $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
+        $customerType = true ? $item : $this->repository->find($this->extractUlid($input['id']));
         if (!$customerType instanceof CustomerType) {
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

88) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:45    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $input = $context['args']['input'];
         $mutationInput = $this->inputTransformer->transform($input);
         $this->validator->validate($mutationInput);
-        $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
+        $customerType = false ? $item : $this->repository->find($this->extractUlid($input['id']));
         if (!$customerType instanceof CustomerType) {
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

89) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:45    [M] Ternary

--- Original
+++ New
@@ @@
         $input = $context['args']['input'];
         $mutationInput = $this->inputTransformer->transform($input);
         $this->validator->validate($mutationInput);
-        $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
+        $customerType = $item instanceof CustomerType ? $this->repository->find($this->extractUlid($input['id'])) : $item;
         if (!$customerType instanceof CustomerType) {
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

90) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:49    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $mutationInput = $this->inputTransformer->transform($input);
         $this->validator->validate($mutationInput);
         $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
-        if (!$customerType instanceof CustomerType) {
+        if (!true) {
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerType, new CustomerValueObject\CustomerTypeUpdate($input['value']));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

91) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:49    [M] LogicalNot

--- Original
+++ New
@@ @@
         $mutationInput = $this->inputTransformer->transform($input);
         $this->validator->validate($mutationInput);
         $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
-        if (!$customerType instanceof CustomerType) {
+        if ($customerType instanceof CustomerType) {
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerType, new CustomerValueObject\CustomerTypeUpdate($input['value']));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

92) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:49    [M] InstanceOf_

--- Original
+++ New
@@ @@
         $mutationInput = $this->inputTransformer->transform($input);
         $this->validator->validate($mutationInput);
         $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
-        if (!$customerType instanceof CustomerType) {
+        if (!false) {
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerType, new CustomerValueObject\CustomerTypeUpdate($input['value']));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

93) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:50    [M] Throw_

--- Original
+++ New
@@ @@
         $this->validator->validate($mutationInput);
         $customerType = $item instanceof CustomerType ? $item : $this->repository->find($this->extractUlid($input['id']));
         if (!$customerType instanceof CustomerType) {
-            throw CustomerTypeNotFoundException::withIri($input['id']);
+            CustomerTypeNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerType, new CustomerValueObject\CustomerTypeUpdate($input['value']));
         $this->commandBus->dispatch($command);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
