94) /srv/app/src/Core/Customer/Application/Resolver/UpdateTypeMutationResolver.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw CustomerTypeNotFoundException::withIri($input['id']);
         }
         $command = $this->factory->create($customerType, new CustomerValueObject\CustomerTypeUpdate($input['value']));
-        $this->commandBus->dispatch($command);
+        
         return $customerType;
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateTypeMutationResolverTest::testInvokeUpdatesType
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateTypeMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

96) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:26    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     public function resolveType(?string $typeIri, Customer $customer) : CustomerType
     {
-        $iri = $typeIri ?? $this->getDefaultTypeIri($customer);
+        $iri = $this->getDefaultTypeIri($customer) ?? $typeIri;
         $resource = $this->iriConverter->getResourceFromIri($iri);
         if (!$resource instanceof CustomerType) {
             throw CustomerTypeNotFoundException::withIri($iri);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveTypeWithProvidedIri
  Expectation failed for method name is "getResourceFromIri" when invoked 1 time(s)
  Parameter 0 for invocation ApiPlatform\Metadata\IriConverterInterface::getResourceFromIri('/api/customer_types/', Array (), null): object does not match expected value.
  Failed asserting that two strings are equal.
  --- Expected
  +++ Actual
  @@ @@
  -'/api/customer_types/8ddf88cd-8c7a-3433-a24d-429191699fc0'
  +'/api/customer_types/'
  
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:20
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:33
  
  FAILURES!
  Tests: 1, Assertions: 0, Failures: 1.

97) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:30    [M] InstanceOf_

--- Original
+++ New
@@ @@
     {
         $iri = $typeIri ?? $this->getDefaultTypeIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
-        if (!$resource instanceof CustomerType) {
+        if (!true) {
             throw CustomerTypeNotFoundException::withIri($iri);
         }
         return $resource;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  ..F
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveTypeThrowsWhenInvalidResourceReturned
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:24
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:79
  .
  
  FAILURES!
  Tests: 3, Assertions: 5, Failures: 1.

98) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:30    [M] InstanceOf_

--- Original
+++ New
@@ @@
     {
         $iri = $typeIri ?? $this->getDefaultTypeIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
-        if (!$resource instanceof CustomerType) {
+        if (!false) {
             throw CustomerTypeNotFoundException::withIri($iri);
         }
         return $resource;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveTypeWithProvidedIri
  App\Core\Customer\Domain\Exception\CustomerTypeNotFoundException: Customer type with IRI "/api/customer_types/139b6a54-7e1f-3ef0-9138-6a6c140e7ce3" not found
  
  /srv/app/src/Core/Customer/Domain/Exception/CustomerTypeNotFoundException.php:13
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:22
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

99) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:30    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $iri = $typeIri ?? $this->getDefaultTypeIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
-        if (!$resource instanceof CustomerType) {
+        if ($resource instanceof CustomerType) {
             throw CustomerTypeNotFoundException::withIri($iri);
         }
         return $resource;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveTypeWithProvidedIri
  App\Core\Customer\Domain\Exception\CustomerTypeNotFoundException: Customer type with IRI "/api/customer_types/58c4d3d1-bd82-30ee-8c51-9c993d9e6437" not found
  
  /srv/app/src/Core/Customer/Domain/Exception/CustomerTypeNotFoundException.php:13
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:22
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

100) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:31    [M] Throw_

--- Original
+++ New
@@ @@
         $iri = $typeIri ?? $this->getDefaultTypeIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
         if (!$resource instanceof CustomerType) {
-            throw CustomerTypeNotFoundException::withIri($iri);
+            CustomerTypeNotFoundException::withIri($iri);
         }
         return $resource;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  ..F
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveTypeThrowsWhenInvalidResourceReturned
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:24
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:79
  .
  
  FAILURES!
  Tests: 3, Assertions: 5, Failures: 1.

101) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:41    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     public function resolveStatus(?string $statusIri, Customer $customer) : CustomerStatus
     {
-        $iri = $statusIri ?? $this->getDefaultStatusIri($customer);
+        $iri = $this->getDefaultStatusIri($customer) ?? $statusIri;
         $resource = $this->iriConverter->getResourceFromIri($iri);
         if (!$resource instanceof CustomerStatus) {
             throw CustomerStatusNotFoundException::withIri($iri);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  ...F
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveStatusWithProvidedIri
  Expectation failed for method name is "getResourceFromIri" when invoked 1 time(s)
  Parameter 0 for invocation ApiPlatform\Metadata\IriConverterInterface::getResourceFromIri('/api/customer_statuses/', Array (), null): object does not match expected value.
  Failed asserting that two strings are equal.
  --- Expected
  +++ Actual
  @@ @@
  -'/api/customer_statuses/d2f6646d-9089-31a3-b7ab-01a18281269b'
  +'/api/customer_statuses/'
  
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:29
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:97
  
  FAILURES!
  Tests: 4, Assertions: 6, Failures: 1.

102) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:45    [M] InstanceOf_

--- Original
+++ New
@@ @@
     {
         $iri = $statusIri ?? $this->getDefaultStatusIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
-        if (!$resource instanceof CustomerStatus) {
+        if (!true) {
             throw CustomerStatusNotFoundException::withIri($iri);
         }
         return $resource;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  .....F                                                              6 / 6 (100%)
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveStatusThrowsWhenInvalidResourceReturned
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:33
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:143
  .
  
  FAILURES!
  Tests: 6, Assertions: 11, Failures: 1.

103) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:45    [M] InstanceOf_

--- Original
+++ New
@@ @@
     {
         $iri = $statusIri ?? $this->getDefaultStatusIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
-        if (!$resource instanceof CustomerStatus) {
+        if (!false) {
             throw CustomerStatusNotFoundException::withIri($iri);
         }
         return $resource;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  ...E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveStatusWithProvidedIri
  App\Core\Customer\Domain\Exception\CustomerStatusNotFoundException: Customer status with IRI "/api/customer_statuses/61490658-a332-3220-88f2-b37b1501e5f2" not found
  
  /srv/app/src/Core/Customer/Domain/Exception/CustomerStatusNotFoundException.php:13
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:31
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:97
  
  ERRORS!
  Tests: 4, Assertions: 6, Errors: 1.

104) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:45    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $iri = $statusIri ?? $this->getDefaultStatusIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
-        if (!$resource instanceof CustomerStatus) {
+        if ($resource instanceof CustomerStatus) {
             throw CustomerStatusNotFoundException::withIri($iri);
         }
         return $resource;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  ...E
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveStatusWithProvidedIri
  App\Core\Customer\Domain\Exception\CustomerStatusNotFoundException: Customer status with IRI "/api/customer_statuses/6eca01ef-53d0-3551-b88f-963b0941003b" not found
  
  /srv/app/src/Core/Customer/Domain/Exception/CustomerStatusNotFoundException.php:13
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:31
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:97
  
  ERRORS!
  Tests: 4, Assertions: 6, Errors: 1.

105) /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:46    [M] Throw_

--- Original
+++ New
@@ @@
         $iri = $statusIri ?? $this->getDefaultStatusIri($customer);
         $resource = $this->iriConverter->getResourceFromIri($iri);
         if (!$resource instanceof CustomerStatus) {
-            throw CustomerStatusNotFoundException::withIri($iri);
+            CustomerStatusNotFoundException::withIri($iri);
         }
         return $resource;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  .....F                                                              6 / 6 (100%)
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Customer\Application\Service\CustomerRelationResolverTest::testResolveStatusThrowsWhenInvalidResourceReturned
  /srv/app/src/Core/Customer/Application/Service/CustomerRelationResolver.php:33
  /srv/app/tests/Unit/Customer/Application/Service/CustomerRelationResolverTest.php:143
  .
  
  FAILURES!
  Tests: 6, Assertions: 11, Failures: 1.

106) /srv/app/src/Core/Customer/Application/Transformer/CreateCustomerMutationInputTransformer.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *     confirmed?: bool|null
      * } $args
      */
-    public function transform(array $args) : CreateCustomerMutationInput
+    protected function transform(array $args) : CreateCustomerMutationInput
     {
         return new CreateCustomerMutationInput($args['initials'] ?? null, $args['email'] ?? null, $args['phone'] ?? null, $args['leadSource'] ?? null, $args['type'] ?? null, $args['status'] ?? null, $args['confirmed'] ?? null);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Transformer\CreateCustomerMutationInputTransformerTest::testTransformMapsAllValues
  Error: Call to protected method App\Core\Customer\Application\Transformer\CreateCustomerMutationInputTransformer::transform() from scope App\Tests\Unit\Customer\Application\Transformer\CreateCustomerMutationInputTransformerTest
  
  /srv/app/tests/Unit/Customer/Application/Transformer/CreateCustomerMutationInputTransformerTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

107) /srv/app/src/Core/Customer/Application/Transformer/CreateStatusMutationInputTransformer.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array{value?: string|null} $args
      */
-    public function transform(array $args) : CreateStatusMutationInput
+    protected function transform(array $args) : CreateStatusMutationInput
     {
         return new CreateStatusMutationInput($args['value'] ?? null);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Transformer\CreateStatusMutationInputTransformerTest::testTransformMapsValue
  Error: Call to protected method App\Core\Customer\Application\Transformer\CreateStatusMutationInputTransformer::transform() from scope App\Tests\Unit\Customer\Application\Transformer\CreateStatusMutationInputTransformerTest
  
  /srv/app/tests/Unit/Customer/Application/Transformer/CreateStatusMutationInputTransformerTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

108) /srv/app/src/Core/Customer/Application/Transformer/CreateTypeMutationInputTransformer.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array{value?: string|null} $args
      */
-    public function transform(array $args) : CreateTypeMutationInput
+    protected function transform(array $args) : CreateTypeMutationInput
     {
         return new CreateTypeMutationInput($args['value'] ?? null);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Transformer\CreateTypeMutationInputTransformerTest::testTransformMapsValue
  Error: Call to protected method App\Core\Customer\Application\Transformer\CreateTypeMutationInputTransformer::transform() from scope App\Tests\Unit\Customer\Application\Transformer\CreateTypeMutationInputTransformerTest
  
  /srv/app/tests/Unit/Customer/Application/Transformer/CreateTypeMutationInputTransformerTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

109) /srv/app/src/Core/Customer/Application/Transformer/UpdateCustomerMutationInputTransformer.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *     confirmed?: bool|null
      * } $args
      */
-    public function transform(array $args) : UpdateCustomerMutationInput
+    protected function transform(array $args) : UpdateCustomerMutationInput
     {
         return new UpdateCustomerMutationInput($args['initials'] ?? null, $args['email'] ?? null, $args['phone'] ?? null, $args['leadSource'] ?? null, $args['type'] ?? null, $args['status'] ?? null, $args['confirmed'] ?? null);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.066, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Transformer\UpdateCustomerMutationInputTransformerTest::testTransformMapsAllValues
  Error: Call to protected method App\Core\Customer\Application\Transformer\UpdateCustomerMutationInputTransformer::transform() from scope App\Tests\Unit\Customer\Application\Transformer\UpdateCustomerMutationInputTransformerTest
  
  /srv/app/tests/Unit/Customer/Application/Transformer/UpdateCustomerMutationInputTransformerTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

110) /srv/app/src/Core/Customer/Application/Transformer/UpdateStatusMutationInputTransformer.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array{value?: string|null} $args
      */
-    public function transform(array $args) : UpdateStatusMutationInput
+    protected function transform(array $args) : UpdateStatusMutationInput
     {
         return new UpdateStatusMutationInput($args['value'] ?? null);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Transformer\UpdateStatusMutationInputTransformerTest::testTransformMapsValue
  Error: Call to protected method App\Core\Customer\Application\Transformer\UpdateStatusMutationInputTransformer::transform() from scope App\Tests\Unit\Customer\Application\Transformer\UpdateStatusMutationInputTransformerTest
  
  /srv/app/tests/Unit/Customer/Application/Transformer/UpdateStatusMutationInputTransformerTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

111) /srv/app/src/Core/Customer/Application/Transformer/UpdateTypeMutationInputTransformer.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array{value?: string|null} $args
      */
-    public function transform(array $args) : UpdateTypeMutationInput
+    protected function transform(array $args) : UpdateTypeMutationInput
     {
         return new UpdateTypeMutationInput($args['value'] ?? null);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Transformer\UpdateTypeMutationInputTransformerTest::testTransformMapsValue
  Error: Call to protected method App\Core\Customer\Application\Transformer\UpdateTypeMutationInputTransformer::transform() from scope App\Tests\Unit\Customer\Application\Transformer\UpdateTypeMutationInputTransformerTest
  
  /srv/app/tests/Unit/Customer/Application/Transformer/UpdateTypeMutationInputTransformerTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

112) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
     }
-    public function getUlid() : string
+    protected function getUlid() : string
     {
         return (string) $this->ulid;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetUlid
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getUlid() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:50
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

113) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:29    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function getUlid() : string
     {
-        return (string) $this->ulid;
+        return $this->ulid;
     }
     public function setUlid(UlidInterface $ulid) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetUlid
  TypeError: App\Core\Customer\Domain\Entity\Customer::getUlid(): Return value must be of type string, App\Shared\Domain\ValueObject\Ulid returned
  
  /srv/app/src/Core/Customer/Domain/Entity/Customer.php:16
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:50
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

114) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (string) $this->ulid;
     }
-    public function setUlid(UlidInterface $ulid) : void
+    protected function setUlid(UlidInterface $ulid) : void
     {
         $this->ulid = $ulid;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetUlid
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setUlid() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:49
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

115) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->ulid = $ulid;
     }
-    public function getInitials() : string
+    protected function getInitials() : string
     {
         return $this->initials;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetInitials
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getInitials() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:64
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

116) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->initials;
     }
-    public function setInitials(string $initials) : void
+    protected function setInitials(string $initials) : void
     {
         $this->initials = $initials;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetInitials
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setInitials() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:63
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

117) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->initials = $initials;
     }
-    public function getEmail() : string
+    protected function getEmail() : string
     {
         return $this->email;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.095, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetEmail
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getEmail() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:57
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

118) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->email;
     }
-    public function setEmail(string $email) : void
+    protected function setEmail(string $email) : void
     {
         $this->email = $email;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetEmail
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setEmail() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:56
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

119) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->email = $email;
     }
-    public function getPhone() : string
+    protected function getPhone() : string
     {
         return $this->phone;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.065, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetPhone
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getPhone() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:71
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

120) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->phone;
     }
-    public function setPhone(string $phone) : void
+    protected function setPhone(string $phone) : void
     {
         $this->phone = $phone;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.074, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetPhone
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setPhone() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:70
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

121) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->phone = $phone;
     }
-    public function getLeadSource() : string
+    protected function getLeadSource() : string
     {
         return $this->leadSource;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.070, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetLeadSource
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getLeadSource() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:78
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

122) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->leadSource;
     }
-    public function setLeadSource(string $leadSource) : void
+    protected function setLeadSource(string $leadSource) : void
     {
         $this->leadSource = $leadSource;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetLeadSource
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setLeadSource() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:77
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

123) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:77    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->leadSource = $leadSource;
     }
-    public function getType() : CustomerType
+    protected function getType() : CustomerType
     {
         return $this->type;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetType
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getType() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:85
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
