124) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->type;
     }
-    public function setType(CustomerType $type) : void
+    protected function setType(CustomerType $type) : void
     {
         $this->type = $type;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetType
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setType() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:84
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

125) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->type = $type;
     }
-    public function getStatus() : CustomerStatus
+    protected function getStatus() : CustomerStatus
     {
         return $this->status;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.116, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetStatus
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getStatus() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:92
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

126) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:92    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->status;
     }
-    public function setStatus(CustomerStatus $status) : void
+    protected function setStatus(CustomerStatus $status) : void
     {
         $this->status = $status;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetStatus
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setStatus() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:91
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

127) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:97    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->status = $status;
     }
-    public function getCreatedAt() : DateTimeInterface
+    protected function getCreatedAt() : DateTimeInterface
     {
         return $this->createdAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetCreatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getCreatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:99
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

128) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:102    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->createdAt;
     }
-    public function setCreatedAt(DateTimeInterface $createdAt) : void
+    protected function setCreatedAt(DateTimeInterface $createdAt) : void
     {
         $this->createdAt = $createdAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetCreatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setCreatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:98
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

129) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->createdAt = $createdAt;
     }
-    public function getUpdatedAt() : DateTimeInterface
+    protected function getUpdatedAt() : DateTimeInterface
     {
         return $this->updatedAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.071, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetUpdatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getUpdatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:106
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

130) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:112    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->updatedAt;
     }
-    public function setUpdatedAt(DateTimeImmutable $updatedAt) : void
+    protected function setUpdatedAt(DateTimeImmutable $updatedAt) : void
     {
         $this->updatedAt = $updatedAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.085, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetUpdatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setUpdatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:105
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

131) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:117    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->updatedAt = $updatedAt;
     }
-    public function isConfirmed() : bool
+    protected function isConfirmed() : bool
     {
         return $this->confirmed;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.115, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetConfirmed
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::isConfirmed() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:112
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

132) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:122    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->confirmed;
     }
-    public function setConfirmed(bool $confirmed) : void
+    protected function setConfirmed(bool $confirmed) : void
     {
         $this->confirmed = $confirmed;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetConfirmed
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setConfirmed() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:111
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

135) /srv/app/src/Core/Customer/Domain/Entity/CustomerStatus.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (string) $this->ulid;
     }
-    public function getValue() : string
+    protected function getValue() : string
     {
         return $this->value;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerStatusTest::testGetValueAndGetUlid
  Error: Call to protected method App\Core\Customer\Domain\Entity\CustomerStatus::getValue() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerStatusTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerStatusTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

136) /srv/app/src/Core/Customer/Domain/Entity/CustomerStatus.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->value;
     }
-    public function setValue(string $value) : void
+    protected function setValue(string $value) : void
     {
         $this->value = $value;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerStatusTest::testSetValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerStatusTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

142) /srv/app/src/Core/Customer/Domain/Exception/CustomerNotFoundException.php:9    [M] PublicVisibility

--- Original
+++ New
@@ @@
 
 final class CustomerNotFoundException extends \RuntimeException
 {
-    public static function withId(string $id) : self
+    protected static function withId(string $id) : self
     {
         return new self(sprintf('Customer with id "%s" not found', $id));
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateCustomerMutationResolverTest::testInvokeUpdatesCustomerWithProvidedData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:177
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:166
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateCustomerMutationResolverTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

143) /srv/app/src/Core/Customer/Domain/Exception/CustomerStatusNotFoundException.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use RuntimeException;
 final class CustomerStatusNotFoundException extends RuntimeException
 {
-    public static function withIri(string $iri) : self
+    protected static function withIri(string $iri) : self
     {
         return new self(sprintf('Customer status with IRI "%s" not found', $iri));
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Resolver\UpdateStatusMutationResolverTest::testInvokeUpdatesStatus
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\MutationInputValidator" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:59
  /srv/app/tests/Unit/Customer/Application/Resolver/UpdateStatusMutationResolverTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

145) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function save(object $entity) : void
     {
-        $this->documentManager->persist($entity);
+        
         $this->documentManager->flush();
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.060, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

146) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(object $entity) : void
     {
         $this->documentManager->persist($entity);
-        $this->documentManager->flush();
+        
     }
     /**
      * Remove and flush an entity.

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

147) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function delete(object $entity) : void
     {
-        $this->documentManager->remove($entity);
+        
         $this->documentManager->flush();
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.066, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

148) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function delete(object $entity) : void
     {
         $this->documentManager->remove($entity);
-        $this->documentManager->flush();
+        
     }
     /**
      * Find one by arbitrary criteria.

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.075, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

149) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return T|null
      */
-    public function findOneByCriteria(array $criteria) : ?object
+    protected function findOneByCriteria(array $criteria) : ?object
     {
         return $this->findOneBy($criteria);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.076, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

150) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoCustomerRepository.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Customer::class);
+        
         $this->documentManager = $this->getDocumentManager();
     }
     public function findByEmail(string $email) : ?Customer

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.066, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

151) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoCustomerRepository.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function findByEmail(string $email) : ?Customer
     {
-        return $this->findOneByCriteria(['email' => $email]);
+        return $this->findOneByCriteria([]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoCustomerRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Core\Customer\Infrastructure\Repository\MongoCustomerRepository" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoCustomerRepositoryTest.php:40
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

152) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, CustomerStatus::class);
+        
         $this->documentManager = $this->getDocumentManager();
     }
     public function deleteByValue(string $value) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoStatusRepositoryTest::testSave
  TypeError: Doctrine\ODM\MongoDB\Repository\DocumentRepository::getDocumentManager(): Return value must be of type Doctrine\ODM\MongoDB\DocumentManager, null returned
  
  /srv/app/vendor/doctrine/mongodb-odm/lib/Doctrine/ODM/MongoDB/Repository/DocumentRepository.php:202
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:17
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoStatusRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

153) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function deleteByValue(string $value) : void
     {
-        $customerStatus = $this->findOneByCriteria(['value' => $value]);
+        $customerStatus = $this->findOneByCriteria([]);
         $this->documentManager->remove($customerStatus);
         $this->documentManager->flush();
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.069, Memory: 18.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoStatusRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "Doctrine\ODM\MongoDB\UnitOfWork" is declared "final" and cannot be doubled
  
  /srv/app/vendor/doctrine/mongodb-odm-bundle/src/Repository/ServiceRepositoryTrait.php:34
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:16
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoStatusRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

154) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function deleteByValue(string $value) : void
     {
         $customerStatus = $this->findOneByCriteria(['value' => $value]);
-        $this->documentManager->remove($customerStatus);
+        
         $this->documentManager->flush();
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 18.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoStatusRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "Doctrine\ODM\MongoDB\UnitOfWork" is declared "final" and cannot be doubled
  
  /srv/app/vendor/doctrine/mongodb-odm-bundle/src/Repository/ServiceRepositoryTrait.php:34
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:16
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoStatusRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

155) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customerStatus = $this->findOneByCriteria(['value' => $value]);
         $this->documentManager->remove($customerStatus);
-        $this->documentManager->flush();
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 18.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoStatusRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "Doctrine\ODM\MongoDB\UnitOfWork" is declared "final" and cannot be doubled
  
  /srv/app/vendor/doctrine/mongodb-odm-bundle/src/Repository/ServiceRepositoryTrait.php:34
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoStatusRepository.php:16
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoStatusRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

156) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, CustomerType::class);
+        
         $this->documentManager = $this->getDocumentManager();
     }
     public function deleteByValue(string $value) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoTypeRepositoryTest::testSave
  TypeError: Doctrine\ODM\MongoDB\Repository\DocumentRepository::getDocumentManager(): Return value must be of type Doctrine\ODM\MongoDB\DocumentManager, null returned
  
  /srv/app/vendor/doctrine/mongodb-odm/lib/Doctrine/ODM/MongoDB/Repository/DocumentRepository.php:202
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:17
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoTypeRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

157) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function deleteByValue(string $value) : void
     {
-        $customerType = $this->findOneByCriteria(['value' => $value]);
+        $customerType = $this->findOneByCriteria([]);
         $this->documentManager->remove($customerType);
         $this->documentManager->flush();
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.068, Memory: 18.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoTypeRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "Doctrine\ODM\MongoDB\UnitOfWork" is declared "final" and cannot be doubled
  
  /srv/app/vendor/doctrine/mongodb-odm-bundle/src/Repository/ServiceRepositoryTrait.php:34
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:16
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoTypeRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

158) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function deleteByValue(string $value) : void
     {
         $customerType = $this->findOneByCriteria(['value' => $value]);
-        $this->documentManager->remove($customerType);
+        
         $this->documentManager->flush();
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 18.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoTypeRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "Doctrine\ODM\MongoDB\UnitOfWork" is declared "final" and cannot be doubled
  
  /srv/app/vendor/doctrine/mongodb-odm-bundle/src/Repository/ServiceRepositoryTrait.php:34
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:16
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoTypeRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

159) /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $customerType = $this->findOneByCriteria(['value' => $value]);
         $this->documentManager->remove($customerType);
-        $this->documentManager->flush();
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.069, Memory: 18.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Infrastructure\Repository\MongoTypeRepositoryTest::testSave
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "Doctrine\ODM\MongoDB\UnitOfWork" is declared "final" and cannot be doubled
  
  /srv/app/vendor/doctrine/mongodb-odm-bundle/src/Repository/ServiceRepositoryTrait.php:34
  /srv/app/src/Core/Customer/Infrastructure/Repository/MongoTypeRepository.php:16
  /srv/app/tests/Unit/Customer/Infrastructure/Repository/MongoTypeRepositoryTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

160) /srv/app/src/Internal/HealthCheck/Application/Controller/HealthCheckController.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __invoke() : Response
     {
         $event = $this->eventFactory->createHealthCheckEvent();
-        $this->eventDispatcher->dispatch($event, HealthCheckEvent::class);
+        
         return new Response(status: Response::HTTP_NO_CONTENT);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\Controller\HealthCheckControllerTest::testInvokeDispatchesHealthCheckEvent
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Internal\HealthCheck\Infrastructure\Factory\Event\HealthEventFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Internal/HealthCheck/Application/Controller/HealthCheckControllerTest.php:27
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

161) /srv/app/src/Internal/HealthCheck/Application/EventSub/BaseHealthCheckSubscriber.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public static function getSubscribedEvents() : array
     {
-        return [HealthCheckEvent::class => 'onHealthCheck'];
+        return [];
     }
     public abstract function onHealthCheck(HealthCheckEvent $event) : void;
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\EventSub\CacheCheckSubscriberTest::testGetSubscribedEvents
  Failed asserting that two arrays are identical.
  --- Expected
  +++ Actual
  @@ @@
  -Array &0 (
  -    'App\Internal\HealthCheck\Domain\Event\HealthCheckEvent' => 'onHealthCheck'
  -)
  +Array &0 ()
  
  /srv/app/tests/Unit/Internal/HealthCheck/Application/EventSub/CacheCheckSubscriberTest.php:44
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

162) /srv/app/src/Internal/HealthCheck/Application/EventSub/BrokerCheckSubscriber.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function onHealthCheck(HealthCheckEvent $event) : void
     {
-        $this->createQueue($this->queueName);
+        
     }
     private function createQueue(string $queueName) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\EventSub\BrokerCheckSubscriberTest::testOnHealthCheckCreatesQueue
  Expectation failed for method name is "__call" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.
