163) /srv/app/src/Internal/HealthCheck/Application/EventSub/BrokerCheckSubscriber.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function createQueue(string $queueName) : void
     {
-        $this->sqsClient->createQueue(['QueueName' => $queueName]);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\EventSub\BrokerCheckSubscriberTest::testOnHealthCheckCreatesQueue
  Expectation failed for method name is "__call" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

164) /srv/app/src/Internal/HealthCheck/Application/EventSub/BrokerCheckSubscriber.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function createQueue(string $queueName) : void
     {
-        $this->sqsClient->createQueue(['QueueName' => $queueName]);
+        $this->sqsClient->createQueue([]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.065, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\EventSub\BrokerCheckSubscriberTest::testOnHealthCheckCreatesQueue
  Expectation failed for method name is "__call" when invoked 1 time(s)
  Parameter 1 for invocation Aws\AwsClient::__call('createQueue', Array (...)) does not match expected value.
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
       0 => Array (
  -        'QueueName' => 'health-check-queue'
       )
   )
  
  /srv/app/src/Internal/HealthCheck/Application/EventSub/BrokerCheckSubscriber.php:23
  /srv/app/src/Internal/HealthCheck/Application/EventSub/BrokerCheckSubscriber.php:19
  /srv/app/tests/Unit/Internal/HealthCheck/Application/EventSub/BrokerCheckSubscriberTest.php:46
  
  FAILURES!

165) /srv/app/src/Internal/HealthCheck/Application/EventSub/CacheCheckSubscriber.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function onHealthCheck(HealthCheckEvent $event) : void
     {
-        $this->cache->get('health_check', static fn() => self::cacheMissHandler());
+        
     }
     private static function cacheMissHandler() : string
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\EventSub\CacheCheckSubscriberTest::testOnHealthCheck
  Expectation failed for method name is "get" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

166) /srv/app/src/Internal/HealthCheck/Application/EventSub/DBCheckSubscriber.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function onHealthCheck(HealthCheckEvent $event) : void
     {
         $client = $this->documentManager->getClient();
-        $client->listDatabases();
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Internal\HealthCheck\Application\EventSub\DBCheckSubscriberTest::testOnHealthCheckSuccess
  Expectation failed for method name is "listDatabases" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

167) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function build(array $params) : ArrayObject
+    protected function build(array $params) : ArrayObject
     {
         $content = new ArrayObject(['application/ld+json' => ['example' => ['']]]);
         if (count($params) > 0) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithEmptyParams
  Error: Call to protected method App\Shared\Application\OpenApi\Builder\ArrayContextBuilder::build() from scope App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

168) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:16    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function build(array $params) : ArrayObject
     {
-        $content = new ArrayObject(['application/ld+json' => ['example' => ['']]]);
+        $content = new ArrayObject([]);
         if (count($params) > 0) {
             $items = [];
             $example = [];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.029, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
  -    'application/ld+json' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:27
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

169) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function build(array $params) : ArrayObject
     {
-        $content = new ArrayObject(['application/ld+json' => ['example' => ['']]]);
+        $content = new ArrayObject(['application/ld+json' => []]);
         if (count($params) > 0) {
             $items = [];
             $example = [];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.031, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/ld+json' => Array (
  -        'example' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:27
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

170) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:18    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function build(array $params) : ArrayObject
     {
-        $content = new ArrayObject(['application/ld+json' => ['example' => ['']]]);
+        $content = new ArrayObject(['application/ld+json' => ['example' => []]]);
         if (count($params) > 0) {
             $items = [];
             $example = [];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/ld+json' => Array (
           'example' => Array (
  -            0 => ''
           )
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:27
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

171) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:22    [M] GreaterThan

--- Original
+++ New
@@ @@
     public function build(array $params) : ArrayObject
     {
         $content = new ArrayObject(['application/ld+json' => ['example' => ['']]]);
-        if (count($params) > 0) {
+        if (count($params) >= 0) {
             $items = [];
             $example = [];
             $required = [];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/ld+json' => Array (
           'example' => Array (
  -            0 => ''
  +            0 => Array ()
           )
  +        'schema' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:27

172) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:22    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     public function build(array $params) : ArrayObject
     {
         $content = new ArrayObject(['application/ld+json' => ['example' => ['']]]);
-        if (count($params) > 0) {
+        if (count($params) <= 0) {
             $items = [];
             $example = [];
             $required = [];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/ld+json' => Array (
           'example' => Array (
  -            0 => ''
  +            0 => Array ()
           )
  +        'schema' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:27

173) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:27    [M] Foreach_

--- Original
+++ New
@@ @@
             $items = [];
             $example = [];
             $required = [];
-            foreach ($params as $param) {
+            foreach (array() as $param) {
                 if ($param->required) {
                     $required[] = $param->name;
                 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'type' => 'array'
               'items' => Array (
                   'properties' => Array (
  -                    'name' => Array (...)
  -                    'age' => Array (...)
                   )
               )
               'required' => Array (
  -                0 => 'name'
  -                1 => 'age'
               )
           )

174) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if ($param->required) {
                     $required[] = $param->name;
                 }
-                $this->addParameterToItems($items, $param);
+                
                 $example[$param->name] = $param->example;
             }
             $content = $this->buildContent($items, $example, $required);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'type' => 'array'
               'items' => Array (
                   'properties' => Array (
  -                    'name' => Array (...)
  -                    'age' => Array (...)
                   )
               )
               'required' => Array (...)
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:52
  
  FAILURES!

175) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function addParameterToItems(array &$items, Parameter $param) : void
     {
-        $items[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $items[$param->name] = ['maxLength' => $param->maxLength, 'format' => $param->format];
     }
     /**
      * @param array<string, string> $items

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.064, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'items' => Array (
                   'properties' => Array (
                       'name' => Array (
  -                        'type' => 'string'
                           'maxLength' => null
                           'format' => null
                       )
                       'age' => Array (
  -                        'type' => 'integer'
                           'maxLength' => null
                           'format' => null
                       )

176) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:47    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function addParameterToItems(array &$items, Parameter $param) : void
     {
-        $items[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $items[$param->name] = ['type' > $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
     }
     /**
      * @param array<string, string> $items

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'items' => Array (
                   'properties' => Array (
                       'name' => Array (
  -                        'type' => 'string'
                           'maxLength' => null
                           'format' => null
  +                        0 => true
                       )
                       'age' => Array (
  -                        'type' => 'integer'
                           'maxLength' => null
                           'format' => null

177) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:48    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function addParameterToItems(array &$items, Parameter $param) : void
     {
-        $items[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $items[$param->name] = ['type' => $param->type, 'maxLength' > $param->maxLength, 'format' => $param->format];
     }
     /**
      * @param array<string, string> $items

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
                   'properties' => Array (
                       'name' => Array (
                           'type' => 'string'
  -                        'maxLength' => null
                           'format' => null
  +                        0 => true
                       )
                       'age' => Array (
                           'type' => 'integer'
  -                        'maxLength' => null
                           'format' => null
  +                        0 => true

178) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:49    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function addParameterToItems(array &$items, Parameter $param) : void
     {
-        $items[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $items[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' > $param->format];
     }
     /**
      * @param array<string, string> $items

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
                       'name' => Array (
                           'type' => 'string'
                           'maxLength' => null
  -                        'format' => null
  +                        0 => true
                       )
                       'age' => Array (
                           'type' => 'integer'
                           'maxLength' => null
  -                        'format' => null
  +                        0 => true
                       )

179) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:63    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(array $items, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => ['properties' => $items], 'required' => $required], 'example' => [$example]]]);
+        return new ArrayObject([]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
  -    'application/ld+json' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:52
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

180) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:64    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(array $items, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => ['properties' => $items], 'required' => $required], 'example' => [$example]]]);
+        return new ArrayObject(['application/ld+json' => ['example' => [$example]]]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/ld+json' => Array (
  -        'schema' => Array (...)
           'example' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:52
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

181) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(array $items, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => ['properties' => $items], 'required' => $required], 'example' => [$example]]]);
+        return new ArrayObject(['application/ld+json' => ['schema' => ['items' => ['properties' => $items], 'required' => $required], 'example' => [$example]]]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/ld+json' => Array (
           'schema' => Array (
  -            'type' => 'array'
               'items' => Array (...)
               'required' => Array (...)
           )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:52
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

182) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:67    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(array $items, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => ['properties' => $items], 'required' => $required], 'example' => [$example]]]);
+        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => [], 'required' => $required], 'example' => [$example]]]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.147, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
           'schema' => Array (
               'type' => 'array'
               'items' => Array (
  -                'properties' => Array (...)
               )
               'required' => Array (...)
           )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:52
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

183) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayContextBuilder.php:70    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(array $items, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => ['properties' => $items], 'required' => $required], 'example' => [$example]]]);
+        return new ArrayObject(['application/ld+json' => ['schema' => ['type' => 'array', 'items' => ['properties' => $items], 'required' => $required], 'example' => []]]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
       'application/ld+json' => Array (
           'schema' => Array (...)
           'example' => Array (
  -            0 => Array (...)
           )
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayContextBuilderTest.php:52
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

184) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param array<Parameter> $params
      * @param array<Header> $headers
      */
-    public function build(string $description, array $params, array $headers) : Response
+    protected function build(string $description, array $params, array $headers) : Response
     {
         $content = $this->contextBuilder->build($params);
         $headersArray = new ArrayObject();

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

185) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:29    [M] GreaterThan

--- Original
+++ New
@@ @@
     {
         $content = $this->contextBuilder->build($params);
         $headersArray = new ArrayObject();
-        if (count($headers) > 0) {
+        if (count($headers) >= 0) {
             foreach ($headers as $header) {
                 $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
             }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

186) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:29    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     {
         $content = $this->contextBuilder->build($params);
         $headersArray = new ArrayObject();
-        if (count($headers) > 0) {
+        if (count($headers) <= 0) {
             foreach ($headers as $header) {
                 $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
             }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

187) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:30    [M] Foreach_

--- Original
+++ New
@@ @@
         $content = $this->contextBuilder->build($params);
         $headersArray = new ArrayObject();
         if (count($headers) > 0) {
-            foreach ($headers as $header) {
+            foreach (array() as $header) {
                 $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
             }
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

188) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $headersArray = new ArrayObject();
         if (count($headers) > 0) {
             foreach ($headers as $header) {
-                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
+                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['format' => $header->format, 'example' => $header->example]);
             }
         }
         return new Response(description: $description, content: $content, headers: $headersArray);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
