189) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:34    [M] ArrayItem

--- Original
+++ New
@@ @@
         $headersArray = new ArrayObject();
         if (count($headers) > 0) {
             foreach ($headers as $header) {
-                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
+                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' > $header->type, 'format' => $header->format, 'example' => $header->example]);
             }
         }
         return new Response(description: $description, content: $content, headers: $headersArray);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

190) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:35    [M] ArrayItem

--- Original
+++ New
@@ @@
         $headersArray = new ArrayObject();
         if (count($headers) > 0) {
             foreach ($headers as $header) {
-                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
+                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' > $header->format, 'example' => $header->example]);
             }
         }
         return new Response(description: $description, content: $content, headers: $headersArray);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

191) /srv/app/src/Shared/Application/OpenApi/Builder/ArrayResponseBuilder.php:36    [M] ArrayItem

--- Original
+++ New
@@ @@
         $headersArray = new ArrayObject();
         if (count($headers) > 0) {
             foreach ($headers as $header) {
-                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' => $header->example]);
+                $headersArray[$header->name] = new Model\Header(description: $header->description, schema: ['type' => $header->type, 'format' => $header->format, 'example' > $header->example]);
             }
         }
         return new Response(description: $description, content: $content, headers: $headersArray);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ArrayResponseBuilderTest::testBuildWithMinimalData
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ArrayContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ArrayResponseBuilderTest.php:34
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

192) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function build(array $params, string $contentType = 'application/problem+json') : ArrayObject
+    protected function build(array $params, string $contentType = 'application/problem+json') : ArrayObject
     {
         $content = new ArrayObject([$contentType => ['example' => '']]);
         if (count($params) > 0) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithEmptyParams
  Error: Call to protected method App\Shared\Application\OpenApi\Builder\ContextBuilder::build() from scope App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:24
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

193) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:18    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function build(array $params, string $contentType = 'application/problem+json') : ArrayObject
     {
-        $content = new ArrayObject([$contentType => ['example' => '']]);
+        $content = new ArrayObject([]);
         if (count($params) > 0) {
             $content = $this->processParams($params, $contentType);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
  -    'application/problem+json' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:26
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

194) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:19    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function build(array $params, string $contentType = 'application/problem+json') : ArrayObject
     {
-        $content = new ArrayObject([$contentType => ['example' => '']]);
+        $content = new ArrayObject([$contentType => []]);
         if (count($params) > 0) {
             $content = $this->processParams($params, $contentType);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/problem+json' => Array (
  -        'example' => ''
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:26
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

195) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:24    [M] GreaterThan

--- Original
+++ New
@@ @@
     public function build(array $params, string $contentType = 'application/problem+json') : ArrayObject
     {
         $content = new ArrayObject([$contentType => ['example' => '']]);
-        if (count($params) > 0) {
+        if (count($params) >= 0) {
             $content = $this->processParams($params, $contentType);
         }
         return $content;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/problem+json' => Array (
  -        'example' => ''
  +        'example' => Array ()
  +        'schema' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:26
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

196) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:24    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     public function build(array $params, string $contentType = 'application/problem+json') : ArrayObject
     {
         $content = new ArrayObject([$contentType => ['example' => '']]);
-        if (count($params) > 0) {
+        if (count($params) <= 0) {
             $content = $this->processParams($params, $contentType);
         }
         return $content;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithEmptyParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/problem+json' => Array (
  -        'example' => ''
  +        'example' => Array ()
  +        'schema' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:26
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

198) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if ($param->required) {
                 $required[] = $param->name;
             }
-            $this->addParameterToProperties($properties, $param);
+            
             $example[$param->name] = $param->example;
         }
         return $this->buildContent($contentType, $properties, $example, $required);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
           'schema' => Array (
               'type' => 'object'
               'properties' => Array (
  -                'name' => Array (...)
  -                'age' => Array (...)
               )
               'required' => Array (...)
           )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:47
  
  FAILURES!

199) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function addParameterToProperties(array &$properties, Parameter $param) : void
     {
-        $properties[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $properties[$param->name] = ['maxLength' => $param->maxLength, 'format' => $param->format];
     }
     /**
      * @param array<string, string> $properties

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'type' => 'object'
               'properties' => Array (
                   'name' => Array (
  -                    'type' => 'string'
                       'maxLength' => null
                       'format' => null
                   )
                   'age' => Array (
  -                    'type' => 'integer'
                       'maxLength' => null
                       'format' => null
                   )

200) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:66    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function addParameterToProperties(array &$properties, Parameter $param) : void
     {
-        $properties[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $properties[$param->name] = ['type' > $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
     }
     /**
      * @param array<string, string> $properties

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.031, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'type' => 'object'
               'properties' => Array (
                   'name' => Array (
  -                    'type' => 'string'
                       'maxLength' => null
                       'format' => null
  +                    0 => true
                   )
                   'age' => Array (
  -                    'type' => 'integer'
                       'maxLength' => null
                       'format' => null

201) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:67    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function addParameterToProperties(array &$properties, Parameter $param) : void
     {
-        $properties[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $properties[$param->name] = ['type' => $param->type, 'maxLength' > $param->maxLength, 'format' => $param->format];
     }
     /**
      * @param array<string, string> $properties

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
               'properties' => Array (
                   'name' => Array (
                       'type' => 'string'
  -                    'maxLength' => null
                       'format' => null
  +                    0 => true
                   )
                   'age' => Array (
                       'type' => 'integer'
  -                    'maxLength' => null
                       'format' => null
  +                    0 => true

202) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:68    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function addParameterToProperties(array &$properties, Parameter $param) : void
     {
-        $properties[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' => $param->format];
+        $properties[$param->name] = ['type' => $param->type, 'maxLength' => $param->maxLength, 'format' > $param->format];
     }
     /**
      * @param array<string, string> $properties

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
                   'name' => Array (
                       'type' => 'string'
                       'maxLength' => null
  -                    'format' => null
  +                    0 => true
                   )
                   'age' => Array (
                       'type' => 'integer'
                       'maxLength' => null
  -                    'format' => null
  +                    0 => true
                   )

203) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:83    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(string $contentType, array $properties, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject([$contentType => ['schema' => ['type' => 'object', 'properties' => $properties, 'required' => $required], 'example' => $example]]);
+        return new ArrayObject([]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
  -    'application/problem+json' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:47
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

204) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:84    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(string $contentType, array $properties, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject([$contentType => ['schema' => ['type' => 'object', 'properties' => $properties, 'required' => $required], 'example' => $example]]);
+        return new ArrayObject([$contentType => ['example' => $example]]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/problem+json' => Array (
  -        'schema' => Array (...)
           'example' => Array (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:47
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

205) /srv/app/src/Shared/Application/OpenApi/Builder/ContextBuilder.php:85    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function buildContent(string $contentType, array $properties, array $example, array $required) : ArrayObject
     {
-        return new ArrayObject([$contentType => ['schema' => ['type' => 'object', 'properties' => $properties, 'required' => $required], 'example' => $example]]);
+        return new ArrayObject([$contentType => ['schema' => ['properties' => $properties, 'required' => $required], 'example' => $example]]);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ContextBuilderTest::testBuildWithSimpleParams
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   ArrayObject Object (
       'application/problem+json' => Array (
           'schema' => Array (
  -            'type' => 'object'
               'properties' => Array (...)
               'required' => Array (...)
           )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ContextBuilderTest.php:47
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

206) /srv/app/src/Shared/Application/OpenApi/Builder/Parameter.php:15    [M] TrueValue

--- Original
+++ New
@@ @@
 
 final readonly class Parameter
 {
-    public function __construct(public string $name, public string $type, public string|int|array|bool $example, public ?int $maxLength = null, public ?string $format = null, public bool $required = true)
+    public function __construct(public string $name, public string $type, public string|int|array|bool $example, public ?int $maxLength = null, public ?string $format = null, public bool $required = false)
     {
     }
     public static function required(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

207) /srv/app/src/Shared/Application/OpenApi/Builder/Parameter.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(public string $name, public string $type, public string|int|array|bool $example, public ?int $maxLength = null, public ?string $format = null, public bool $required = true)
     {
     }
-    public static function required(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
+    protected static function required(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
     {
         return new self($name, $type, $example, $maxLength, $format, true);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ParameterTest::testRequiredCreatesParameterWithRequiredTrue
  Error: Call to protected method App\Shared\Application\OpenApi\Builder\Parameter::required() from scope App\Tests\Unit\Shared\Application\OpenApi\Builder\ParameterTest
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ParameterTest.php:31
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

208) /srv/app/src/Shared/Application/OpenApi/Builder/Parameter.php:26    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     public static function required(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
     {
-        return new self($name, $type, $example, $maxLength, $format, true);
+        return new self($name, $type, $example, $maxLength, $format, false);
     }
     public static function optional(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ParameterTest::testRequiredCreatesParameterWithRequiredTrue
  Failed asserting that false is true.
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ParameterTest.php:36
  
  FAILURES!
  Tests: 1, Assertions: 4, Failures: 1.

209) /srv/app/src/Shared/Application/OpenApi/Builder/Parameter.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self($name, $type, $example, $maxLength, $format, true);
     }
-    public static function optional(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
+    protected static function optional(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
     {
         return new self($name, $type, $example, $maxLength, $format, false);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ParameterTest::testOptionalCreatesParameterWithRequiredFalse
  Error: Call to protected method App\Shared\Application\OpenApi\Builder\Parameter::optional() from scope App\Tests\Unit\Shared\Application\OpenApi\Builder\ParameterTest
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ParameterTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

210) /srv/app/src/Shared/Application/OpenApi/Builder/Parameter.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     public static function optional(string $name, string $type, string|int|array|bool $example, ?int $maxLength = null, ?string $format = null) : self
     {
-        return new self($name, $type, $example, $maxLength, $format, false);
+        return new self($name, $type, $example, $maxLength, $format, true);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\ParameterTest::testOptionalCreatesParameterWithRequiredFalse
  Failed asserting that true is false.
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/ParameterTest.php:50
  
  FAILURES!
  Tests: 1, Assertions: 4, Failures: 1.

211) /srv/app/src/Shared/Application/OpenApi/Builder/RequestBuilder.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function build(array $params, bool $required = true, string $contentType = 'application/ld+json') : RequestBody
+    protected function build(array $params, bool $required = true, string $contentType = 'application/ld+json') : RequestBody
     {
         $content = $this->contextBuilder->build($params, $contentType);
         return new RequestBody(content: $content, required: $required);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestBuilderTest::testBuildWithEmptyParams
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestBuilderTest.php:23
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

212) /srv/app/src/Shared/Application/OpenApi/Builder/RequestBuilder.php:20    [M] TrueValue

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function build(array $params, bool $required = true, string $contentType = 'application/ld+json') : RequestBody
+    public function build(array $params, bool $required = false, string $contentType = 'application/ld+json') : RequestBody
     {
         $content = $this->contextBuilder->build($params, $contentType);
         return new RequestBody(content: $content, required: $required);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestBuilderTest::testBuildWithEmptyParams
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestBuilderTest.php:23
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

213) /srv/app/src/Shared/Application/OpenApi/Builder/RequestBuilder.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function buildRequired(array $params, string $contentType = 'application/ld+json') : RequestBody
+    protected function buildRequired(array $params, string $contentType = 'application/ld+json') : RequestBody
     {
         return $this->build($params, true, $contentType);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestBuilderTest::testBuildWithEmptyParams
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestBuilderTest.php:23
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

214) /srv/app/src/Shared/Application/OpenApi/Builder/RequestBuilder.php:38    [M] TrueValue

--- Original
+++ New
@@ @@
      */
     public function buildRequired(array $params, string $contentType = 'application/ld+json') : RequestBody
     {
-        return $this->build($params, true, $contentType);
+        return $this->build($params, false, $contentType);
     }
     /**
      * @param array<Parameter> $params

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestBuilderTest::testBuildWithEmptyParams
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestBuilderTest.php:23
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
