215) /srv/app/src/Shared/Application/OpenApi/Builder/RequestBuilder.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function buildOptional(array $params, string $contentType = 'application/ld+json') : RequestBody
+    protected function buildOptional(array $params, string $contentType = 'application/ld+json') : RequestBody
     {
         return $this->build($params, false, $contentType);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestBuilderTest::testBuildWithEmptyParams
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestBuilderTest.php:23
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

216) /srv/app/src/Shared/Application/OpenApi/Builder/RequestBuilder.php:48    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     public function buildOptional(array $params, string $contentType = 'application/ld+json') : RequestBody
     {
-        return $this->build($params, false, $contentType);
+        return $this->build($params, true, $contentType);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestBuilderTest::testBuildWithEmptyParams
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestBuilderTest.php:23
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

217) /srv/app/src/Shared/Application/OpenApi/Builder/RequestPatchBuilder.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function build(array $params, bool $required = true, string $contentType = 'application/merge-patch+json') : RequestBody
+    protected function build(array $params, bool $required = true, string $contentType = 'application/merge-patch+json') : RequestBody
     {
         $content = $this->contextBuilder->build($params, $contentType);
         return new RequestBody(content: $content, required: $required);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestPatchBuilderTest::testBuild
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestPatchBuilderTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

218) /srv/app/src/Shared/Application/OpenApi/Builder/RequestPatchBuilder.php:20    [M] TrueValue

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function build(array $params, bool $required = true, string $contentType = 'application/merge-patch+json') : RequestBody
+    public function build(array $params, bool $required = false, string $contentType = 'application/merge-patch+json') : RequestBody
     {
         $content = $this->contextBuilder->build($params, $contentType);
         return new RequestBody(content: $content, required: $required);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestPatchBuilderTest::testBuild
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestPatchBuilderTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

219) /srv/app/src/Shared/Application/OpenApi/Builder/RequestPatchBuilder.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function buildRequired(array $params, string $contentType = 'application/merge-patch+json') : RequestBody
+    protected function buildRequired(array $params, string $contentType = 'application/merge-patch+json') : RequestBody
     {
         return $this->build($params, true, $contentType);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestPatchBuilderTest::testBuild
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestPatchBuilderTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

221) /srv/app/src/Shared/Application/OpenApi/Builder/RequestPatchBuilder.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param array<Parameter> $params
      */
-    public function buildOptional(array $params, string $contentType = 'application/merge-patch+json') : RequestBody
+    protected function buildOptional(array $params, string $contentType = 'application/merge-patch+json') : RequestBody
     {
         return $this->build($params, false, $contentType);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\RequestPatchBuilderTest::testBuild
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ContextBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/RequestPatchBuilderTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

231) /srv/app/src/Shared/Application/OpenApi/Builder/UriParameterBuilder.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use ApiPlatform\OpenApi\Model\Parameter;
 final class UriParameterBuilder
 {
-    public function build(string $name, string $description, bool $required, string $example, string $type) : Parameter
+    protected function build(string $name, string $description, bool $required, string $example, string $type) : Parameter
     {
         return new Parameter(name: $name, in: 'path', description: $description, required: $required, schema: ['type' => $type], example: $example);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\UriParameterBuilderTest::testBuildWithMinimalData
  Error: Call to protected method App\Shared\Application\OpenApi\Builder\UriParameterBuilder::build() from scope App\Tests\Unit\Shared\Application\OpenApi\Builder\UriParameterBuilderTest
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/UriParameterBuilderTest.php:30
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

232) /srv/app/src/Shared/Application/OpenApi/Builder/UriParameterBuilder.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function build(string $name, string $description, bool $required, string $example, string $type) : Parameter
     {
-        return new Parameter(name: $name, in: 'path', description: $description, required: $required, schema: ['type' => $type], example: $example);
+        return new Parameter(name: $name, in: 'path', description: $description, required: $required, schema: [], example: $example);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Builder\UriParameterBuilderTest::testBuildWithMinimalData
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
  -    'type' => 'quis'
   )
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Builder/UriParameterBuilderTest.php:43
  
  FAILURES!
  Tests: 1, Assertions: 6, Failures: 1.

233) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $operationGet = $pathItem->getGet();
         $mergedGet = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
         $mergedPost = $this->mergeResponses($operationPost->getResponses(), $this->getPostResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPost($operationPost->withResponses($mergedPost)->withRequestBody($this->createCustomerRequest))->withGet($operationGet->withResponses($mergedGet)));
+        
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CrCReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

240) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:100    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CrCReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

241) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:101    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST > $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CrCReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

242) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:102    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.026, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CrCReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

243) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:103    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CrCReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

244) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CrCReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

245) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function createEndpoint(OpenApi $openApi) : void
     {
-        $this->setPutOperation($openApi);
+        
         $this->setPatchOperation($openApi);
         $this->setGetOperation($openApi);
         $this->setDeleteOperation($openApi);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

246) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:88    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function createEndpoint(OpenApi $openApi) : void
     {
         $this->setPutOperation($openApi);
-        $this->setPatchOperation($openApi);
+        
         $this->setGetOperation($openApi);
         $this->setDeleteOperation($openApi);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

247) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->setPutOperation($openApi);
         $this->setPatchOperation($openApi);
-        $this->setGetOperation($openApi);
+        
         $this->setDeleteOperation($openApi);
     }
     private function setPutOperation(OpenApi $openApi) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

248) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->setPutOperation($openApi);
         $this->setPatchOperation($openApi);
         $this->setGetOperation($openApi);
-        $this->setDeleteOperation($openApi);
+        
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.027, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

249) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:102    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerRequest)));
+        
     }
     private function setPatchOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.021, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

250) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:106    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerRequest)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerRequest)));
     }
     private function setPatchOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.033, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

251) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:121    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->uuidWithExamplePathParam])->withRequestBody($this->updateCustomerRequest)->withResponses($mergedResponses)));
+        
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.023, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

252) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:126    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->uuidWithExamplePathParam])->withRequestBody($this->updateCustomerRequest)->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([])->withRequestBody($this->updateCustomerRequest)->withResponses($mergedResponses)));
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.021, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
