253) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:137    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $pathItem = $this->getPathItem($openApi);
         $operationDelete = $pathItem->getDelete();
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withDelete($operationDelete->withParameters([$this->uuidWithExamplePathParam])->withResponses($this->getDeleteResponses())));
+        
     }
     private function setGetOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

254) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:140    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $pathItem = $this->getPathItem($openApi);
         $operationDelete = $pathItem->getDelete();
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withDelete($operationDelete->withParameters([$this->uuidWithExamplePathParam])->withResponses($this->getDeleteResponses())));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withDelete($operationDelete->withParameters([])->withResponses($this->getDeleteResponses())));
     }
     private function setGetOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

255) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:153    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationGet = $pathItem->getGet();
         $mergedResponses = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withGet($operationGet->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)));
+        
     }
     private function getPathItem(OpenApi $openApi) : PathItem
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

256) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:155    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationGet = $pathItem->getGet();
         $mergedResponses = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withGet($operationGet->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withGet($operationGet->withParameters([])->withResponses($mergedResponses)));
     }
     private function getPathItem(OpenApi $openApi) : PathItem
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

263) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:185    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

264) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:186    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

265) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:187    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

266) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:188    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND > $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

267) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:189    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

275) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/CustomerStatusEndpointFactory.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $operationGet = $pathItem->getGet();
         $mergedGet = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
         $mergedPost = $this->mergeResponses($operationPost->getResponses(), $this->getPostResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPost($operationPost->withResponses($mergedPost)->withRequestBody($this->createCustomerStatusRequest))->withGet($operationGet->withResponses($mergedGet)));
+        
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\CustomerStatusEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\CustomerStatus\CrCStReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/CustomerStatusEndpointFactoryTest.php:64
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/CustomerStatusEndpointFactoryTest.php:47
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

287) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function createEndpoint(OpenApi $openApi) : void
     {
-        $this->setPatchOperation($openApi);
+        
         $this->setPutOperation($openApi);
         $this->setGetOperation($openApi);
         $this->setDeleteOperation($openApi);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

288) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function createEndpoint(OpenApi $openApi) : void
     {
         $this->setPatchOperation($openApi);
-        $this->setPutOperation($openApi);
+        
         $this->setGetOperation($openApi);
         $this->setDeleteOperation($openApi);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.026, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

289) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:88    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->setPatchOperation($openApi);
         $this->setPutOperation($openApi);
-        $this->setGetOperation($openApi);
+        
         $this->setDeleteOperation($openApi);
     }
     private function setPatchOperation(OpenApi $openApi) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

291) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:100    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->uuidWithExamplePathParam])->withRequestBody($this->updateCustomerStatusRequest)->withResponses($mergedResponses)));
+        
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.021, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

292) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:105    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->uuidWithExamplePathParam])->withRequestBody($this->updateCustomerStatusRequest)->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([])->withRequestBody($this->updateCustomerStatusRequest)->withResponses($mergedResponses)));
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

293) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerStatusRequest)));
+        
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

294) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:124    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerStatusRequest)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerStatusRequest)));
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

305) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:182    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.021, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

306) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:183    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

307) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:184    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
