308) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:185    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND > $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

309) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:186    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

317) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/CTyEndpointFactory.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $operationGet = $pathItem->getGet();
         $mergedGet = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
         $mergedPost = $this->mergeResponses($operationPost->getResponses(), $this->getPostResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPost($operationPost->withResponses($mergedPost)->withRequestBody($this->createCustomerTypeRequest))->withGet($operationGet->withResponses($mergedGet)));
+        
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\TypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\CustomerType\CrCTyReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:90
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:59
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

333) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:100    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->uuidWithExamplePathParam])->withRequestBody($this->updateCustomerTypeRequest)->withResponses($mergedResponses)));
+        
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

334) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:105    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->uuidWithExamplePathParam])->withRequestBody($this->updateCustomerTypeRequest)->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([])->withRequestBody($this->updateCustomerTypeRequest)->withResponses($mergedResponses)));
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

335) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerTypeRequest)));
+        
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

336) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:124    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->uuidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerTypeRequest)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerTypeRequest)));
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

347) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:187    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

348) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:188    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

349) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:189    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.024, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

350) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:190    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND > $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.021, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

351) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:191    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HTTPResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HTTPResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

359) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/EndpointFactory.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array<int,Response>
      */
-    public function mergeResponses(array $baseResponses, array $overrideResponses) : array
+    protected function mergeResponses(array $baseResponses, array $overrideResponses) : array
     {
         return array_replace($baseResponses, $overrideResponses);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\TypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\CustomerType\CrCTyReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:90
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:59
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

360) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/EndpointFactory.php:21    [M] UnwrapArrayReplace

--- Original
+++ New
@@ @@
      */
     public function mergeResponses(array $baseResponses, array $overrideResponses) : array
     {
-        return array_replace($baseResponses, $overrideResponses);
+        return $baseResponses;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.021, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\TypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\CustomerType\CrCTyReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:90
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:59
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

361) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/EndpointFactory.php:21    [M] UnwrapArrayReplace

--- Original
+++ New
@@ @@
      */
     public function mergeResponses(array $baseResponses, array $overrideResponses) : array
     {
-        return array_replace($baseResponses, $overrideResponses);
+        return $overrideResponses;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.014, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\TypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\CustomerType\CrCTyReq" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:90
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/TypeEndpointFactoryTest.php:59
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

362) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:26    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array<Parameter>
      */
-    protected function getDefaultParameters() : array
+    private function getDefaultParameters() : array
     {
         return [$this->getEmailParam(), $this->getPhoneParam(), $this->getInitialsParam(), $this->getLeadSourceParam(), $this->getTypeParam(), $this->getStatusParam(), $this->getConfirmedParam()];
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

363) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function getDefaultParameters() : array
     {
-        return [$this->getEmailParam(), $this->getPhoneParam(), $this->getInitialsParam(), $this->getLeadSourceParam(), $this->getTypeParam(), $this->getStatusParam(), $this->getConfirmedParam()];
+        return [$this->getPhoneParam(), $this->getInitialsParam(), $this->getLeadSourceParam(), $this->getTypeParam(), $this->getStatusParam(), $this->getConfirmedParam()];
     }
     protected function getConfirmedParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

364) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:39    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return [$this->getEmailParam(), $this->getPhoneParam(), $this->getInitialsParam(), $this->getLeadSourceParam(), $this->getTypeParam(), $this->getStatusParam(), $this->getConfirmedParam()];
     }
-    protected function getConfirmedParam() : Parameter
+    private function getConfirmedParam() : Parameter
     {
         return new Parameter('confirmed', 'boolean', true);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

365) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:41    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     protected function getConfirmedParam() : Parameter
     {
-        return new Parameter('confirmed', 'boolean', true);
+        return new Parameter('confirmed', 'boolean', false);
     }
     protected function getEmailParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

366) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:44    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('confirmed', 'boolean', true);
     }
-    protected function getEmailParam() : Parameter
+    private function getEmailParam() : Parameter
     {
         return new Parameter('email', 'string', 'customer@example.com', 255, 'email');
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

367) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:50    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getEmailParam() : Parameter
     {
-        return new Parameter('email', 'string', 'customer@example.com', 255, 'email');
+        return new Parameter('email', 'string', 'customer@example.com', 256, 'email');
     }
     protected function getPhoneParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

368) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:50    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getEmailParam() : Parameter
     {
-        return new Parameter('email', 'string', 'customer@example.com', 255, 'email');
+        return new Parameter('email', 'string', 'customer@example.com', 254, 'email');
     }
     protected function getPhoneParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
