369) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:55    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('email', 'string', 'customer@example.com', 255, 'email');
     }
-    protected function getPhoneParam() : Parameter
+    private function getPhoneParam() : Parameter
     {
         return new Parameter('phone', 'string', '0123456789', 255);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

370) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:57    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getPhoneParam() : Parameter
     {
-        return new Parameter('phone', 'string', '0123456789', 255);
+        return new Parameter('phone', 'string', '0123456789', 254);
     }
     protected function getLeadSourceParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

371) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:57    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getPhoneParam() : Parameter
     {
-        return new Parameter('phone', 'string', '0123456789', 255);
+        return new Parameter('phone', 'string', '0123456789', 256);
     }
     protected function getLeadSourceParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

372) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:60    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('phone', 'string', '0123456789', 255);
     }
-    protected function getLeadSourceParam() : Parameter
+    private function getLeadSourceParam() : Parameter
     {
         return new Parameter('leadSource', 'string', 'Google', 255);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

373) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:62    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getLeadSourceParam() : Parameter
     {
-        return new Parameter('leadSource', 'string', 'Google', 255);
+        return new Parameter('leadSource', 'string', 'Google', 254);
     }
     protected function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

374) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:62    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getLeadSourceParam() : Parameter
     {
-        return new Parameter('leadSource', 'string', 'Google', 255);
+        return new Parameter('leadSource', 'string', 'Google', 256);
     }
     protected function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

375) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:65    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('leadSource', 'string', 'Google', 255);
     }
-    protected function getTypeParam() : Parameter
+    private function getTypeParam() : Parameter
     {
         return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

376) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:71    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 254);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

377) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:71    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 256);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

378) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:75    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255);
     }
-    protected function getStatusParam() : Parameter
+    private function getStatusParam() : Parameter
     {
         return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

379) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 254);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

380) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 256);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

381) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:85    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255);
     }
-    protected function getInitialsParam() : Parameter
+    private function getInitialsParam() : Parameter
     {
         return new Parameter('initials', 'string', 'Name Surname', 255);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

382) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:87    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getInitialsParam() : Parameter
     {
-        return new Parameter('initials', 'string', 'Name Surname', 255);
+        return new Parameter('initials', 'string', 'Name Surname', 256);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

383) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:87    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getInitialsParam() : Parameter
     {
-        return new Parameter('initials', 'string', 'Name Surname', 255);
+        return new Parameter('initials', 'string', 'Name Surname', 254);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

384) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:27    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     protected function getConfirmedParam() : Parameter
     {
-        return new Parameter('confirmed', 'boolean', true, required: false);
+        return new Parameter('confirmed', 'boolean', false, required: false);
     }
     protected function getEmailParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.031, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

385) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:28    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getConfirmedParam() : Parameter
     {
-        return new Parameter('confirmed', 'boolean', true, required: false);
+        return new Parameter('confirmed', 'boolean', true, required: true);
     }
     protected function getEmailParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

386) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:38    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getEmailParam() : Parameter
     {
-        return new Parameter('email', 'string', 'customer@example.com', 255, 'email', required: false);
+        return new Parameter('email', 'string', 'customer@example.com', 254, 'email', required: false);
     }
     protected function getPhoneParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

387) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:38    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getEmailParam() : Parameter
     {
-        return new Parameter('email', 'string', 'customer@example.com', 255, 'email', required: false);
+        return new Parameter('email', 'string', 'customer@example.com', 256, 'email', required: false);
     }
     protected function getPhoneParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.029, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

388) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:40    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getEmailParam() : Parameter
     {
-        return new Parameter('email', 'string', 'customer@example.com', 255, 'email', required: false);
+        return new Parameter('email', 'string', 'customer@example.com', 255, 'email', required: true);
     }
     protected function getPhoneParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

389) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:50    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getPhoneParam() : Parameter
     {
-        return new Parameter('phone', 'string', '0123456789', 255, required: false);
+        return new Parameter('phone', 'string', '0123456789', 254, required: false);
     }
     protected function getLeadSourceParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

390) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:50    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getPhoneParam() : Parameter
     {
-        return new Parameter('phone', 'string', '0123456789', 255, required: false);
+        return new Parameter('phone', 'string', '0123456789', 256, required: false);
     }
     protected function getLeadSourceParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

391) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:51    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getPhoneParam() : Parameter
     {
-        return new Parameter('phone', 'string', '0123456789', 255, required: false);
+        return new Parameter('phone', 'string', '0123456789', 255, required: true);
     }
     protected function getLeadSourceParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

392) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:61    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getLeadSourceParam() : Parameter
     {
-        return new Parameter('leadSource', 'string', 'Google', 255, required: false);
+        return new Parameter('leadSource', 'string', 'Google', 254, required: false);
     }
     protected function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

393) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:61    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getLeadSourceParam() : Parameter
     {
-        return new Parameter('leadSource', 'string', 'Google', 255, required: false);
+        return new Parameter('leadSource', 'string', 'Google', 256, required: false);
     }
     protected function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

394) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:62    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getLeadSourceParam() : Parameter
     {
-        return new Parameter('leadSource', 'string', 'Google', 255, required: false);
+        return new Parameter('leadSource', 'string', 'Google', 255, required: true);
     }
     protected function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

395) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:72    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255, required: false);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 254, required: false);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
