396) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:72    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255, required: false);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 256, required: false);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

397) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:73    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255, required: false);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/768e998b-31cb-419d-a02c-6ae9d5b4f447', 255, required: true);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

398) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:83    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255, required: false);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 254, required: false);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

399) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:83    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255, required: false);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 256, required: false);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

400) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:84    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255, required: false);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/c27f0884-8b6f-45db-858d-9a987a1d20d7', 255, required: true);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

401) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:94    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getInitialsParam() : Parameter
     {
-        return new Parameter('initials', 'string', 'Name Surname', 255, required: false);
+        return new Parameter('initials', 'string', 'Name Surname', 256, required: false);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

402) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:94    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getInitialsParam() : Parameter
     {
-        return new Parameter('initials', 'string', 'Name Surname', 255, required: false);
+        return new Parameter('initials', 'string', 'Name Surname', 254, required: false);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

403) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/UpCReq.php:95    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     protected function getInitialsParam() : Parameter
     {
-        return new Parameter('initials', 'string', 'Name Surname', 255, required: false);
+        return new Parameter('initials', 'string', 'Name Surname', 255, required: true);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\UpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/UpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

405) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerStatus/CustomerStatusRequestFactory.php:29    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     protected function getDefaultParameters() : array
     {
-        return [$this->getValueParam()];
+        return [];
     }
     protected function getValueParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Status\StatusCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Status/StatusCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

406) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerStatus/CustomerStatusRequestFactory.php:34    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     {
         return [$this->getValueParam()];
     }
-    protected function getValueParam() : Parameter
+    private function getValueParam() : Parameter
     {
         return new Parameter('value', 'string', 'Active', 255);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Status\StatusCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Status/StatusCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

407) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerStatus/CustomerStatusRequestFactory.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getValueParam() : Parameter
     {
-        return new Parameter('value', 'string', 'Active', 255);
+        return new Parameter('value', 'string', 'Active', 254);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Status\StatusCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Status/StatusCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

408) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerStatus/CustomerStatusRequestFactory.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getValueParam() : Parameter
     {
-        return new Parameter('value', 'string', 'Active', 255);
+        return new Parameter('value', 'string', 'Active', 256);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Status\StatusCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Status/StatusCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

412) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/CustomerTypeRequestFactory.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getValueParam() : Parameter
     {
-        return new Parameter('value', 'string', 'Prospect', 255);
+        return new Parameter('value', 'string', 'Prospect', 254);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeUpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeUpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

413) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/CustomerTypeRequestFactory.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getValueParam() : Parameter
     {
-        return new Parameter('value', 'string', 'Prospect', 255);
+        return new Parameter('value', 'string', 'Prospect', 256);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeUpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeUpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

414) /srv/app/src/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactory.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('Bad request', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('Bad request', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\BadRequestResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactoryTest.php:17
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

415) /srv/app/src/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactory.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->responseBuilder->build('Bad request', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
-    public function getTypeParam() : Parameter
+    protected function getTypeParam() : Parameter
     {
         return new Parameter('type', 'string', 'https://tools.ietf.org/html/rfc2616#section-10');
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\BadRequestResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactoryTest.php:17
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

416) /srv/app/src/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactory.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('type', 'string', 'https://tools.ietf.org/html/rfc2616#section-10');
     }
-    public function getTitleParam() : Parameter
+    protected function getTitleParam() : Parameter
     {
         return new Parameter('title', 'string', 'An error occurred');
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\BadRequestResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactoryTest.php:17
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

417) /srv/app/src/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactory.php:50    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('title', 'string', 'An error occurred');
     }
-    public function getDetailParam() : Parameter
+    protected function getDetailParam() : Parameter
     {
         return new Parameter('detail', 'string', 'The input data is misformatted.');
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\BadRequestResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactoryTest.php:17
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

418) /srv/app/src/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactory.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new Parameter('detail', 'string', 'The input data is misformatted.');
     }
-    public function getStatusParam() : Parameter
+    protected function getStatusParam() : Parameter
     {
         return new Parameter('status', 'integer', HttpResponse::HTTP_BAD_REQUEST);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\BadRequestResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/BadRequestResponseFactoryTest.php:17
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

419) /srv/app/src/Shared/Application/OpenApi/Factory/Response/Customer/CNFResp.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('Customer not found', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('Customer not found', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\Customer\NotFoundFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/Customer/NotFoundFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

424) /srv/app/src/Shared/Application/OpenApi/Factory/Response/CustomerStatus/CStNFResp.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('CustomerStatus not found', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('CustomerStatus not found', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\Status\NotFoundFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/Status/NotFoundFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

429) /srv/app/src/Shared/Application/OpenApi/Factory/Response/CustomerType/TyNFResp.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('CustomerType not found', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('CustomerType not found', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\Type\NotFoundFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/Type/NotFoundFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

434) /srv/app/src/Shared/Application/OpenApi/Factory/Response/ForbiddenResponseFactory.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('Forbidden', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('Forbidden', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     private function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\ForbiddenResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/ForbiddenResponseFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

435) /srv/app/src/Shared/Application/OpenApi/Factory/Response/InternalErrorFactory.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('Internal server error', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('Internal server error', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\InternalServerErrorResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/InternalServerErrorResponseFactoryTest.php:17
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

440) /srv/app/src/Shared/Application/OpenApi/Factory/Response/UnauthorizedResponseFactory.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('Unauthorized', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('Unauthorized', [$this->getTitleParam(), $this->getDetailParam(), $this->getStatusParam()], []);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\UnauthorizedResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/UnauthorizedResponseFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

445) /srv/app/src/Shared/Application/OpenApi/Factory/Response/ValidationErrorFactory.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getResponse() : Response
     {
-        return $this->responseBuilder->build('Validation error', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getViolationsParam(), $this->getStatusParam()], []);
+        return $this->responseBuilder->build('Validation error', [$this->getTitleParam(), $this->getDetailParam(), $this->getViolationsParam(), $this->getStatusParam()], []);
     }
     public function getViolationsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\ValidationErrorResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/ValidationErrorResponseFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
