446) /srv/app/src/Shared/Application/OpenApi/Factory/Response/ValidationErrorFactory.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->responseBuilder->build('Validation error', [$this->getTypeParam(), $this->getTitleParam(), $this->getDetailParam(), $this->getViolationsParam(), $this->getStatusParam()], []);
     }
-    public function getViolationsParam() : Parameter
+    protected function getViolationsParam() : Parameter
     {
         return new Parameter('violations', 'array', ['propertyPath' => 'some_property', 'message' => 'This value should not be blank.', 'code' => 'c1051bb4-d103-4f74-8988-acbcafc7fdc3']);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\ValidationErrorResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/ValidationErrorResponseFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

447) /srv/app/src/Shared/Application/OpenApi/Factory/Response/ValidationErrorFactory.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getViolationsParam() : Parameter
     {
-        return new Parameter('violations', 'array', ['propertyPath' => 'some_property', 'message' => 'This value should not be blank.', 'code' => 'c1051bb4-d103-4f74-8988-acbcafc7fdc3']);
+        return new Parameter('violations', 'array', ['message' => 'This value should not be blank.', 'code' => 'c1051bb4-d103-4f74-8988-acbcafc7fdc3']);
     }
     public function getTypeParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Response\ValidationErrorResponseFactoryTest::testGetResponse
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\ResponseBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Response/ValidationErrorResponseFactoryTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

452) /srv/app/src/Shared/Application/OpenApi/Factory/UriParameter/UuidUriParameterFactory.php:21    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     public function getParameter() : Parameter
     {
-        return $this->parameterBuilder->build('ulid', $this->getDescription(), true, '01JKX8XGHVDZ46MWYMZT94YER4', 'string');
+        return $this->parameterBuilder->build('ulid', $this->getDescription(), false, '01JKX8XGHVDZ46MWYMZT94YER4', 'string');
     }
     protected abstract function getDescription() : string;
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\UriParameter\CustomerStatusFactoryTest::testGetParameterReturnsCorrectParameter
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\UriParameterBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/UriParameter/CustomerStatusFactoryTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

453) /srv/app/src/Shared/Application/OpenApi/OpenApiFactory.php:28    [M] Foreach_

--- Original
+++ New
@@ @@
     public function __invoke(array $context = []) : OpenApi
     {
         $openApi = $this->decorated->__invoke($context);
-        foreach ($this->endpointFactories as $endpointFactory) {
+        foreach (array() as $endpointFactory) {
             $endpointFactory->createEndpoint($openApi);
         }
         return $openApi;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\OpenApiFactoryTest::testInvoke
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "ApiPlatform\OpenApi\OpenApi" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/OpenApiFactoryTest.php:28
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

454) /srv/app/src/Shared/Application/OpenApi/OpenApiFactory.php:29    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $openApi = $this->decorated->__invoke($context);
         foreach ($this->endpointFactories as $endpointFactory) {
-            $endpointFactory->createEndpoint($openApi);
+            
         }
         return $openApi;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\OpenApiFactoryTest::testInvoke
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "ApiPlatform\OpenApi\OpenApi" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/OpenApiFactoryTest.php:28
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

455) /srv/app/src/Shared/Application/Validator/Initials.php:19    [M] Coalesce

--- Original
+++ New
@@ @@
     private bool $optional = false;
     public function __construct(?array $groups = null, mixed $payload = null, ?bool $optional = null)
     {
-        $this->optional = $optional ?? $this->optional;
+        $this->optional = $this->optional ?? $optional;
         parent::__construct([], $groups, $payload);
     }
     public function isOptional() : bool

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

456) /srv/app/src/Shared/Application/Validator/Initials.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(?array $groups = null, mixed $payload = null, ?bool $optional = null)
     {
         $this->optional = $optional ?? $this->optional;
-        parent::__construct([], $groups, $payload);
+        
     }
     public function isOptional() : bool
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsTest::testConstraintInitialization
  null does not match expected type "array".
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsTest.php:19
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

457) /srv/app/src/Shared/Application/Validator/Initials.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->optional = $optional ?? $this->optional;
         parent::__construct([], $groups, $payload);
     }
-    public function isOptional() : bool
+    protected function isOptional() : bool
     {
         return $this->optional;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

458) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:20    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value === null || $value === '') {
+        if ($value !== null || $value === '') {
             if ($value === '' && !$constraint->isOptional()) {
                 return;
             }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

459) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:20    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value === null || $value === '') {
+        if (!($value === null) || !($value === '')) {
             if ($value === '' && !$constraint->isOptional()) {
                 return;
             }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

460) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:20    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value === null || $value === '') {
+        if ($value === null || $value !== '') {
             if ($value === '' && !$constraint->isOptional()) {
                 return;
             }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

461) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:20    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value === null || $value === '') {
+        if (!($value === null || $value === '')) {
             if ($value === '' && !$constraint->isOptional()) {
                 return;
             }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

462) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:21    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function validate(mixed $value, Constraint $constraint) : void
     {
         if ($value === null || $value === '') {
-            if ($value === '' && !$constraint->isOptional()) {
+            if ($value === '' && $constraint->isOptional()) {
                 return;
             }
             return;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

463) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:21    [M] Identical

--- Original
+++ New
@@ @@
     public function validate(mixed $value, Constraint $constraint) : void
     {
         if ($value === null || $value === '') {
-            if ($value === '' && !$constraint->isOptional()) {
+            if ($value !== '' && !$constraint->isOptional()) {
                 return;
             }
             return;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

464) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:21    [M] LogicalAnd

--- Original
+++ New
@@ @@
     public function validate(mixed $value, Constraint $constraint) : void
     {
         if ($value === null || $value === '') {
-            if ($value === '' && !$constraint->isOptional()) {
+            if ($value === '' || !$constraint->isOptional()) {
                 return;
             }
             return;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

465) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:21    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     public function validate(mixed $value, Constraint $constraint) : void
     {
         if ($value === null || $value === '') {
-            if ($value === '' && !$constraint->isOptional()) {
+            if (!($value === '' && !$constraint->isOptional())) {
                 return;
             }
             return;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

466) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:21    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     public function validate(mixed $value, Constraint $constraint) : void
     {
         if ($value === null || $value === '') {
-            if ($value === '' && !$constraint->isOptional()) {
+            if (!($value === '') && $constraint->isOptional()) {
                 return;
             }
             return;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

467) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:27    [M] UnwrapTrim

--- Original
+++ New
@@ @@
             }
             return;
         }
-        if (trim($value) === '') {
+        if ($value === '') {
             $this->context->buildViolation($this->translator->trans('initials.spaces'))->addViolation();
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

468) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:27    [M] Identical

--- Original
+++ New
@@ @@
             }
             return;
         }
-        if (trim($value) === '') {
+        if (trim($value) !== '') {
             $this->context->buildViolation($this->translator->trans('initials.spaces'))->addViolation();
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

469) /srv/app/src/Shared/Application/Validator/InitialsValidator.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         if (trim($value) === '') {
-            $this->context->buildViolation($this->translator->trans('initials.spaces'))->addViolation();
+            
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\Validator\InitialsValidatorTest::testValidValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\Validator\Initials" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/Validator/InitialsValidatorTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

470) /srv/app/src/Shared/Application/Validator/MutationInputValidator.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private ValidatorInterface $validator)
     {
     }
-    public function validate(MutationInput $input) : void
+    protected function validate(MutationInput $input) : void
     {
         $violations = $this->validator->validate($input);
         if (count($violations) > 0) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.059, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\GraphQL\MutationInputValidatorTest::testValidateSucceedsWhenNoViolations
  Error: Call to protected method App\Shared\Application\Validator\MutationInputValidator::validate() from scope App\Tests\Unit\Shared\Application\GraphQL\MutationInputValidatorTest
  
  /srv/app/tests/Unit/Shared/Application/GraphQL/MutationInputValidatorTest.php:35
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

471) /srv/app/src/Shared/Application/Validator/MutationInputValidator.php:22    [M] GreaterThan

--- Original
+++ New
@@ @@
     public function validate(MutationInput $input) : void
     {
         $violations = $this->validator->validate($input);
-        if (count($violations) > 0) {
+        if (count($violations) >= 0) {
             throw new ValidationException($violations);
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\GraphQL\MutationInputValidatorTest::testValidateSucceedsWhenNoViolations
  ApiPlatform\Validator\Exception\ValidationException: 
  
  /srv/app/src/Shared/Application/Validator/MutationInputValidator.php:18
  /srv/app/tests/Unit/Shared/Application/GraphQL/MutationInputValidatorTest.php:35
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

472) /srv/app/src/Shared/Application/Validator/MutationInputValidator.php:22    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     public function validate(MutationInput $input) : void
     {
         $violations = $this->validator->validate($input);
-        if (count($violations) > 0) {
+        if (count($violations) <= 0) {
             throw new ValidationException($violations);
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\GraphQL\MutationInputValidatorTest::testValidateSucceedsWhenNoViolations
  ApiPlatform\Validator\Exception\ValidationException: 
  
  /srv/app/src/Shared/Application/Validator/MutationInputValidator.php:18
  /srv/app/tests/Unit/Shared/Application/GraphQL/MutationInputValidatorTest.php:35
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

473) /srv/app/src/Shared/Application/Validator/MutationInputValidator.php:23    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $violations = $this->validator->validate($input);
         if (count($violations) > 0) {
-            throw new ValidationException($violations);
+            new ValidationException($violations);
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.059, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\GraphQL\MutationInputValidatorTest::testValidateThrowsWhenViolationsExist
  ValidationException was not thrown.
  
  /srv/app/tests/Unit/Shared/Application/GraphQL/MutationInputValidatorTest.php:61
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

474) /srv/app/src/Shared/Application/Validator/UniqueEmail.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(?array $groups = null, mixed $payload = null)
     {
-        parent::__construct([], $groups, $payload);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailTest::testConstructor
  Failed asserting that null is identical to Array &0 (
      0 => 'ea'
      1 => 'architecto'
  ).
  
  /srv/app/tests/Unit/Shared/Application/Validator/UniqueEmailTest.php:21
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

475) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:23    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value !== null && $this->customerRepository->findByEmail($value)) {
+        if ($value === null && $this->customerRepository->findByEmail($value)) {
             $this->addViolation($this->translator->trans('email.not.unique'));
         }
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.065, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "findByEmail" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

476) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:23    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value !== null && $this->customerRepository->findByEmail($value)) {
+        if ($value !== null || $this->customerRepository->findByEmail($value)) {
             $this->addViolation($this->translator->trans('email.not.unique'));
         }
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "findByEmail" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

477) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:23    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value !== null && $this->customerRepository->findByEmail($value)) {
+        if (!($value !== null) && !$this->customerRepository->findByEmail($value)) {
             $this->addViolation($this->translator->trans('email.not.unique'));
         }
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "findByEmail" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

478) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:23    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value !== null && $this->customerRepository->findByEmail($value)) {
+        if (!($value !== null && $this->customerRepository->findByEmail($value))) {
             $this->addViolation($this->translator->trans('email.not.unique'));
         }
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "buildViolation" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

479) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:23    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     }
     public function validate(mixed $value, Constraint $constraint) : void
     {
-        if ($value !== null && $this->customerRepository->findByEmail($value)) {
+        if ($value !== null && !$this->customerRepository->findByEmail($value)) {
             $this->addViolation($this->translator->trans('email.not.unique'));
         }
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "buildViolation" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

480) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function validate(mixed $value, Constraint $constraint) : void
     {
         if ($value !== null && $this->customerRepository->findByEmail($value)) {
-            $this->addViolation($this->translator->trans('email.not.unique'));
+            
         }
     }
     private function addViolation(string $message) : void

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "buildViolation" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

481) /srv/app/src/Shared/Application/Validator/UniqueEmailValidator.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function addViolation(string $message) : void
     {
-        $this->context->buildViolation($message)->addViolation();
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.073, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Application\Validator\UniqueEmailValidatorTest::testValidate
  Expectation failed for method name is "buildViolation" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.
