482) /srv/app/src/Shared/Domain/Aggregate/AggregateRoot.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array<DomainEvent>
      */
-    public final function pullDomainEvents() : array
+    protected final function pullDomainEvents() : array
     {
         $domainEvents = $this->domainEvents;
         $this->domainEvents = [];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Domain\Aggregate\AggregateRootTest::testPullDomainEventsFromOutside
  Error: Call to protected method App\Shared\Domain\Aggregate\AggregateRoot::pullDomainEvents() from scope App\Tests\Unit\Shared\Domain\Aggregate\AggregateRootTest
  
  /srv/app/tests/Unit/Shared/Domain/Aggregate/AggregateRootTest.php:58
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

483) /srv/app/src/Shared/Domain/Aggregate/AggregateRoot.php:24    [M] ArrayOneItem

--- Original
+++ New
@@ @@
     {
         $domainEvents = $this->domainEvents;
         $this->domainEvents = [];
-        return $domainEvents;
+        return count($domainEvents) > 1 ? array_slice($domainEvents, 0, 1, true) : $domainEvents;
     }
     protected final function record(DomainEvent $domainEvent) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Domain\Aggregate\AggregateRootTest::testPullDomainEvents
  Failed asserting that actual size 1 matches expected size 2.
  
  /srv/app/tests/Unit/Shared/Domain/Aggregate/AggregateRootTest.php:38
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

484) /srv/app/src/Shared/Domain/Bus/Event/DomainEvent.php:17    [M] Coalesce

--- Original
+++ New
@@ @@
     public function __construct(string $eventId, ?string $occurredOn)
     {
         $this->eventId = $eventId;
-        $this->occurredOn = $occurredOn ?? self::dateToString(new DateTimeImmutable());
+        $this->occurredOn = self::dateToString(new DateTimeImmutable()) ?? $occurredOn;
     }
     /**
      * @param array<string, string|object> $body

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Domain\Bus\DomainEventTest::testConstructWithProvidedDate
  Failed asserting that two strings are equal.
  --- Expected
  +++ Actual
  @@ @@
  -'2023-07-24'
  +'2025-10-22T11:32:46+00:00'
  
  /srv/app/tests/Unit/Shared/Domain/Bus/DomainEventTest.php:21
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

485) /srv/app/src/Shared/Domain/Bus/Event/DomainEvent.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @return array<string, string|object>
      */
     public abstract function toPrimitives() : array;
-    public function eventId() : string
+    protected function eventId() : string
     {
         return $this->eventId;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Domain\Bus\DomainEventTest::testEventIdIsAccessibleAndCorrect
  Error: Call to protected method App\Shared\Domain\Bus\Event\DomainEvent::eventId() from scope App\Tests\Unit\Shared\Domain\Bus\DomainEventTest
  
  /srv/app/tests/Unit/Shared/Domain/Bus/DomainEventTest.php:36
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

486) /srv/app/src/Shared/Domain/Bus/Event/DomainEvent.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->eventId;
     }
-    public function occurredOn() : string
+    protected function occurredOn() : string
     {
         return $this->occurredOn;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.048, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Domain\Bus\DomainEventTest::testConstructWithProvidedDate
  Error: Call to protected method App\Shared\Domain\Bus\Event\DomainEvent::occurredOn() from scope App\Tests\Unit\Shared\Domain\Bus\DomainEventTest
  
  /srv/app/tests/Unit/Shared/Domain/Bus/DomainEventTest.php:21
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

487) /srv/app/src/Shared/Domain/ValueObject/Ulid.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->uid;
     }
-    public function toBinary() : string
+    protected function toBinary() : string
     {
         $ulid = strtr($this->uid, 'ABCDEFGHJKMNPQRSTVWXYZ', 'abcdefghijklmnopqrstuv');

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Domain\ValueObject\UlidTest::testToBinaryReturns16Bytes
  Error: Call to protected method App\Shared\Domain\ValueObject\Ulid::toBinary() from scope App\Tests\Unit\Shared\Domain\ValueObject\UlidTest
  
  /srv/app/tests/Unit/Shared/Domain/ValueObject/UlidTest.php:27
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

551) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array<int, string|null>
      */
-    public static function forCallables(iterable $callables) : array
+    protected static function forCallables(iterable $callables) : array
     {
         $callableArray = iterator_to_array($callables);
         $keys = array_map(self::classExtractor(new self()), $callableArray);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\MessageBusFactoryTest::testCreate
  Error: Call to protected method App\Shared\Infrastructure\Bus\CallableFirstParameterExtractor::forCallables() from scope App\Shared\Infrastructure\Bus\MessageBusFactory
  
  /srv/app/src/Shared/Infrastructure/Bus/MessageBusFactory.php:29
  /srv/app/src/Shared/Infrastructure/Bus/MessageBusFactory.php:18
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/MessageBusFactoryTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

552) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:22    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
     public static function forCallables(iterable $callables) : array
     {
         $callableArray = iterator_to_array($callables);
-        $keys = array_map(self::classExtractor(new self()), $callableArray);
+        $keys = $callableArray;
         $values = array_map(self::unflatten(), $callableArray);
         return array_combine($keys, $values);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Error: Object of class App\Shared\Domain\Bus\Event\DomainEventSubscriberInterface@anonymous could not be converted to string
  
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:21
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:43
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

553) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:27    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
     {
         $callableArray = iterator_to_array($callables);
         $keys = array_map(self::classExtractor(new self()), $callableArray);
-        $values = array_map(self::unflatten(), $callableArray);
+        $values = $callableArray;
         return array_combine($keys, $values);
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.022, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
  -    '' => Array (...)
  +    '' => App\Shared\Domain\Bus\Event\DomainEventSubscriberInterface@anonymous /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:24$20 Object ()
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:45
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

554) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:32    [M] UnwrapArrayCombine

--- Original
+++ New
@@ @@
         $callableArray = iterator_to_array($callables);
         $keys = array_map(self::classExtractor(new self()), $callableArray);
         $values = array_map(self::unflatten(), $callableArray);
-        return array_combine($keys, $values);
+        return $keys;
     }
     /**
      * @param iterable<DomainEventSubscriberInterface> $callables

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
  -    '' => Array (...)
  +    0 => null
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:45
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

555) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:32    [M] UnwrapArrayCombine

--- Original
+++ New
@@ @@
         $callableArray = iterator_to_array($callables);
         $keys = array_map(self::classExtractor(new self()), $callableArray);
         $values = array_map(self::unflatten(), $callableArray);
-        return array_combine($keys, $values);
+        return $values;
     }
     /**
      * @param iterable<DomainEventSubscriberInterface> $callables

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
  -    '' => Array (...)
  +    0 => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:45
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

556) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array<int, array<DomainEventSubscriberInterface>>
      */
-    public static function forPipedCallables(iterable $callables) : array
+    protected static function forPipedCallables(iterable $callables) : array
     {
         return array_reduce(iterator_to_array($callables), self::pipedCallablesReducer(), []);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForPipedCallables
  Error: Call to protected method App\Shared\Infrastructure\Bus\CallableFirstParameterExtractor::forPipedCallables() from scope App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

557) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:42    [M] UnwrapArrayReduce

--- Original
+++ New
@@ @@
      */
     public static function forPipedCallables(iterable $callables) : array
     {
-        return array_reduce(iterator_to_array($callables), self::pipedCallablesReducer(), []);
+        return [];
     }
     public function extract(object|string $class) : ?string
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForPipedCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
  -    'MyEvent1' => Array (...)
  -    'MyEvent2' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:64
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

558) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return array_reduce(iterator_to_array($callables), self::pipedCallablesReducer(), []);
     }
-    public function extract(object|string $class) : ?string
+    protected function extract(object|string $class) : ?string
     {
         $reflector = new ReflectionClass($class);
         $method = $reflector->getMethod('__invoke');

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtract
  Error: Call to protected method App\Shared\Infrastructure\Bus\CallableFirstParameterExtractor::extract() from scope App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:85
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

559) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:54    [M] IfNegation

--- Original
+++ New
@@ @@
     {
         $reflector = new ReflectionClass($class);
         $method = $reflector->getMethod('__invoke');
-        if ($this->hasOnlyOneParameter($method)) {
+        if (!$this->hasOnlyOneParameter($method)) {
             return $this->firstParameterClassFrom($method);
         }
         return null;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Undefined array key 0
  
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:70
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:37
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:47
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:43
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:19
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:43
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

560) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:83    [M] UnwrapArrayReduce

--- Original
+++ New
@@ @@
     }
     private static function pipedCallablesReducer() : callable
     {
-        return static fn(array $subscribers, DomainEventSubscriberInterface $subscriber): array => array_reduce($subscriber->subscribedTo(), static fn(array $carry, string $event) => self::addSubscriberToEvent($carry, $event, $subscriber), $subscribers);
+        return static fn(array $subscribers, DomainEventSubscriberInterface $subscriber): array => $subscribers;
     }
     /**
      * @param array<DomainEventSubscriberInterface> $subscribers

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForPipedCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
  -    'MyEvent1' => Array (...)
  -    'MyEvent2' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:64
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

561) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:104    [M] ArrayOneItem

--- Original
+++ New
@@ @@
     private static function addSubscriberToEvent(array $subscribers, string $event, DomainEventSubscriberInterface $subscriber) : array
     {
         $subscribers[$event][] = $subscriber;
-        return $subscribers;
+        return count($subscribers) > 1 ? array_slice($subscribers, 0, 1, true) : $subscribers;
     }
     private static function unflatten() : callable
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.019, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForPipedCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
       'MyEvent1' => Array (...)
  -    'MyEvent2' => Array (...)
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:64
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

562) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:109    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private static function unflatten() : callable
     {
-        return static fn($value) => [$value];
+        return static fn($value) => [];
     }
     private function firstParameterClassFrom(\ReflectionMethod $method) : string
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Failed asserting that two arrays are equal.
  --- Expected
  +++ Actual
  @@ @@
   Array (
       '' => Array (
  -        0 => App\Shared\Domain\Bus\Event\DomainEventSubscriberInterface@anonymous /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:24$20 Object ()
       )
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:45
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

563) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:115    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function firstParameterClassFrom(\ReflectionMethod $method) : string
     {
         /** @var \ReflectionNamedType $firstParameterType */
-        $firstParameterType = $method->getParameters()[0]->getType();
+        $firstParameterType = $method->getParameters()[1]->getType();
         if ($firstParameterType === null) {
             throw new LogicException('Missing type hint for the first parameter of __invoke');
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtract
  Undefined array key 1
  
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:70
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:37
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:85
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

564) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:117    [M] Identical

--- Original
+++ New
@@ @@
     {
         /** @var \ReflectionNamedType $firstParameterType */
         $firstParameterType = $method->getParameters()[0]->getType();
-        if ($firstParameterType === null) {
+        if ($firstParameterType !== null) {
             throw new LogicException('Missing type hint for the first parameter of __invoke');
         }
         return $firstParameterType->getName();

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtract
  LogicException: Missing type hint for the first parameter of __invoke
  
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:72
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:37
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:85
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

565) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:118    [M] Throw_

--- Original
+++ New
@@ @@
         /** @var \ReflectionNamedType $firstParameterType */
         $firstParameterType = $method->getParameters()[0]->getType();
         if ($firstParameterType === null) {
-            throw new LogicException('Missing type hint for the first parameter of __invoke');
+            new LogicException('Missing type hint for the first parameter of __invoke');
         }
         return $firstParameterType->getName();
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.017, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractWithError
  Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Call to a member function getName() on null" at
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:74
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:37
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:110
  .
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

566) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:128    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function hasOnlyOneParameter(\ReflectionMethod $method) : bool
     {
-        return $method->getNumberOfParameters() === 1;
+        return $method->getNumberOfParameters() === 2;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtract
  Failed asserting that null matches expected 'App\Shared\Domain\Bus\Event\DomainEvent'.
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:87
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

567) /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:128    [M] Identical

--- Original
+++ New
@@ @@
     }
     private function hasOnlyOneParameter(\ReflectionMethod $method) : bool
     {
-        return $method->getNumberOfParameters() === 1;
+        return $method->getNumberOfParameters() !== 1;
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.018, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\CallableFirstParameterExtractorTest::testExtractForCallables
  Undefined array key 0
  
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:70
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:37
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:47
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:43
  /srv/app/src/Shared/Infrastructure/Bus/CallableFirstParameterExtractor.php:19
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/CallableFirstParameterExtractorTest.php:43
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

568) /srv/app/src/Shared/Infrastructure/Bus/Command/CommandNotRegisteredException.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(CommandInterface $command)
     {
         $commandClass = $command::class;
-        parent::__construct("The command <{$commandClass}> hasn't a command handler associated");
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Command\CommandNotRegisteredExceptionTest::testConstruct
  Failed asserting that two strings are equal.
  --- Expected
  +++ Actual
  @@ @@
  -'The command <Mock_CommandInterface_67d62a6e> hasn't a command handler associated'
  +''
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Command/CommandNotRegisteredExceptionTest.php:22
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

571) /srv/app/src/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBus.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function dispatch(CommandInterface $command) : void
     {
         try {
-            $this->bus->dispatch($command);
+            
         } catch (NoHandlerForMessageException) {
             throw new CommandNotRegisteredException($command);
         } catch (HandlerFailedException $error) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Command\InMemorySymfonyCommandBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

572) /srv/app/src/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBus.php:37    [M] Throw_

--- Original
+++ New
@@ @@
         try {
             $this->bus->dispatch($command);
         } catch (NoHandlerForMessageException) {
-            throw new CommandNotRegisteredException($command);
+            new CommandNotRegisteredException($command);
         } catch (HandlerFailedException $error) {
             throw $error->getPrevious() ?? $error;
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Command\InMemorySymfonyCommandBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

573) /srv/app/src/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBus.php:39    [M] Coalesce

--- Original
+++ New
@@ @@
         } catch (NoHandlerForMessageException) {
             throw new CommandNotRegisteredException($command);
         } catch (HandlerFailedException $error) {
-            throw $error->getPrevious() ?? $error;
+            throw $error ?? $error->getPrevious();
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Command\InMemorySymfonyCommandBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

574) /srv/app/src/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBus.php:39    [M] Throw_

--- Original
+++ New
@@ @@
         } catch (NoHandlerForMessageException) {
             throw new CommandNotRegisteredException($command);
         } catch (HandlerFailedException $error) {
-            throw $error->getPrevious() ?? $error;
+            $error->getPrevious() ?? $error;
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.029, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Command\InMemorySymfonyCommandBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Command/InMemorySymfonyCommandBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

575) /srv/app/src/Shared/Infrastructure/Bus/Event/EventNotRegisteredException.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(DomainEvent $event)
     {
         $eventClass = $event::class;
-        parent::__construct("The event <{$eventClass}> hasn't an event handler associated");
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\EventNotRegisteredExceptionTest::testConstruct
  Failed asserting that two strings are equal.
  --- Expected
  +++ Actual
  @@ @@
  -'The event <Mock_DomainEvent_99d31869> hasn't an event handler associated'
  +''
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/EventNotRegisteredExceptionTest.php:22
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.
