576) /srv/app/src/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBus.php:32    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     }
     public function publish(DomainEvent ...$events) : void
     {
-        array_walk($events, [$this, 'dispatchEvent']);
+        
     }
     /**
      * @param iterable<DomainEventSubscriberInterface> $subscribers

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\InMemorySymfonyEventBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

577) /srv/app/src/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBus.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function publish(DomainEvent ...$events) : void
     {
-        array_walk($events, [$this, 'dispatchEvent']);
+        array_walk($events, ['dispatchEvent']);
     }
     /**
      * @param iterable<DomainEventSubscriberInterface> $subscribers

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\InMemorySymfonyEventBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

580) /srv/app/src/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBus.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function dispatchEvent(DomainEvent $event) : void
     {
         try {
-            $this->bus->dispatch($event);
+            
         } catch (NoHandlerForMessageException) {
             throw new EventNotRegisteredException($event);
         } catch (HandlerFailedException $exception) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.038, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\InMemorySymfonyEventBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

581) /srv/app/src/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBus.php:50    [M] Throw_

--- Original
+++ New
@@ @@
         try {
             $this->bus->dispatch($event);
         } catch (NoHandlerForMessageException) {
-            throw new EventNotRegisteredException($event);
+            new EventNotRegisteredException($event);
         } catch (HandlerFailedException $exception) {
             throw $exception->getPrevious() ?? $exception;
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\InMemorySymfonyEventBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

582) /srv/app/src/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBus.php:52    [M] Coalesce

--- Original
+++ New
@@ @@
         } catch (NoHandlerForMessageException) {
             throw new EventNotRegisteredException($event);
         } catch (HandlerFailedException $exception) {
-            throw $exception->getPrevious() ?? $exception;
+            throw $exception ?? $exception->getPrevious();
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\InMemorySymfonyEventBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

583) /srv/app/src/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBus.php:52    [M] Throw_

--- Original
+++ New
@@ @@
         } catch (NoHandlerForMessageException) {
             throw new EventNotRegisteredException($event);
         } catch (HandlerFailedException $exception) {
-            throw $exception->getPrevious() ?? $exception;
+            $exception->getPrevious() ?? $exception;
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\Event\InMemorySymfonyEventBusTest::testDispatchWithNoHandlerForMessageException
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Bus\MessageBusFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/Event/InMemorySymfonyEventBusTest.php:29
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

584) /srv/app/src/Shared/Infrastructure/Bus/MessageBusFactory.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @param iterable<object> $callables
      */
-    public function create(iterable $callables) : MessageBus
+    protected function create(iterable $callables) : MessageBus
     {
         return new MessageBus([$this->getMiddleWare($callables)]);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.033, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\MessageBusFactoryTest::testCreate
  Error: Call to protected method App\Shared\Infrastructure\Bus\MessageBusFactory::create() from scope App\Tests\Unit\Shared\Infrastructure\Bus\MessageBusFactoryTest
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/MessageBusFactoryTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

585) /srv/app/src/Shared/Infrastructure/Bus/MessageBusFactory.php:18    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function create(iterable $callables) : MessageBus
     {
-        return new MessageBus([$this->getMiddleWare($callables)]);
+        return new MessageBus([]);
     }
     /**
      * @param iterable<object> $callables

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Bus\MessageBusFactoryTest::testCreate
  Failed asserting that two objects are equal.
  --- Expected
  +++ Actual
  @@ @@
   Symfony\Component\Messenger\MessageBus Object (
       'middlewareAggregate' => ArrayObject Object (
  -        0 => Symfony\Component\Messenger\Middleware\HandleMessageMiddleware Object (...)
       )
   )
  
  /srv/app/tests/Unit/Shared/Infrastructure/Bus/MessageBusFactoryTest.php:36
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

586) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
 final class UlidType extends Type
 {
     public const NAME = 'ulid';
-    public function getName() : string
+    protected function getName() : string
     {
         return self::NAME;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.039, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testGetName
  Error: Call to protected method App\Shared\Infrastructure\DoctrineType\UlidType::getName() from scope App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:18
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

587) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:24    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function convertToDatabaseValue(mixed $value) : ?Binary
     {
-        if ($value instanceof Binary) {
+        if (true) {
             return $value;
         }
         return (new UlidTransformer(new UlidFactory()))->toDatabaseValue($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.043, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

588) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:24    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function convertToDatabaseValue(mixed $value) : ?Binary
     {
-        if ($value instanceof Binary) {
+        if (false) {
             return $value;
         }
         return (new UlidTransformer(new UlidFactory()))->toDatabaseValue($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithBinary
  TypeError: App\Shared\Infrastructure\Factory\UlidFactory::create(): Argument #1 ($ulid) must be of type string, MongoDB\BSON\Binary given, called in /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php on line 30
  
  /srv/app/src/Shared/Infrastructure/Factory/UlidFactory.php:12
  /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:30
  /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:23
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:25
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

589) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:33    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function convertToPHPValue(mixed $value) : ?Ulid
     {
-        if ($value === null) {
+        if ($value !== null) {
             return null;
         }
         if ($value instanceof Ulid) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.093, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

590) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:36    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if ($value instanceof Ulid) {
+        if (false) {
             return $value;
         }
         $binary = $value instanceof Binary ? $value->getData() : $value;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.042, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

591) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:36    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if ($value instanceof Ulid) {
+        if (true) {
             return $value;
         }
         $binary = $value instanceof Binary ? $value->getData() : $value;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

592) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:39    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($value instanceof Ulid) {
             return $value;
         }
-        $binary = $value instanceof Binary ? $value->getData() : $value;
+        $binary = true ? $value->getData() : $value;
         return (new UlidTransformer(new UlidFactory()))->toPhpValue($binary);
     }
     public function closureToMongo() : string

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.047, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

593) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:39    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($value instanceof Ulid) {
             return $value;
         }
-        $binary = $value instanceof Binary ? $value->getData() : $value;
+        $binary = false ? $value->getData() : $value;
         return (new UlidTransformer(new UlidFactory()))->toPhpValue($binary);
     }
     public function closureToMongo() : string

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

594) /srv/app/src/Shared/Infrastructure/DoctrineType/UlidType.php:39    [M] Ternary

--- Original
+++ New
@@ @@
         if ($value instanceof Ulid) {
             return $value;
         }
-        $binary = $value instanceof Binary ? $value->getData() : $value;
+        $binary = $value instanceof Binary ? $value : $value->getData();
         return (new UlidTransformer(new UlidFactory()))->toPhpValue($binary);
     }
     public function closureToMongo() : string

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\DoctrineType\UlidTypeTest::testConvertToDatabaseValueWithUlid
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Domain\ValueObject\Ulid" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/DoctrineType/UlidTypeTest.php:33
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

595) /srv/app/src/Shared/Infrastructure/Filter/Between.php:16    [M] IfNegation

--- Original
+++ New
@@ @@
 {
     public function apply(Builder $builder, string $field, mixed $filterValue) : void
     {
-        if (is_array($filterValue)) {
+        if (!is_array($filterValue)) {
             [$min, $max] = $filterValue;
             $builder->match()->field($field)->gte($min)->lte($max);
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.059, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithUlidRange
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

596) /srv/app/src/Shared/Infrastructure/Filter/Between.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         if (is_array($filterValue)) {
             [$min, $max] = $filterValue;
-            $builder->match()->field($field)->gte($min)->lte($max);
+            
         }
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithUlidRange
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

597) /srv/app/src/Shared/Infrastructure/Filter/Gt.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function apply(Builder $builder, string $field, mixed $filterValue) : void
     {
-        $builder->match()->field($field)->gt($filterValue);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithDifferentOperators
  Expectation failed for method name is "match" when invoked 4 time(s).
  Method was expected to be called 4 times, actually called 3 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

598) /srv/app/src/Shared/Infrastructure/Filter/Gte.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function apply(Builder $builder, string $field, mixed $filterValue) : void
     {
-        $builder->match()->field($field)->gte($filterValue);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\GteTest::testApply
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

599) /srv/app/src/Shared/Infrastructure/Filter/Lt.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function apply(Builder $builder, string $field, mixed $filterValue) : void
     {
-        $builder->match()->field($field)->lt($filterValue);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\LtTest::testApply
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

600) /srv/app/src/Shared/Infrastructure/Filter/Lte.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function apply(Builder $builder, string $field, mixed $filterValue) : void
     {
-        $builder->match()->field($field)->lte($filterValue);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\LteTest::testApply
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

601) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Doctrine\ODM\MongoDB\Aggregation\Builder;
 final class UlidFilterProcessor
 {
-    public function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
+    protected function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
     {
         if (!$this->isUlidProperty($property) || !is_string($rawValue)) {
             return;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithNonUlidProperty
  Error: Call to protected method App\Shared\Infrastructure\Filter\UlidFilterProcessor::process() from scope App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:31
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

602) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:18    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     public function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
     {
-        if (!$this->isUlidProperty($property) || !is_string($rawValue)) {
+        if ($this->isUlidProperty($property) || !is_string($rawValue)) {
             return;
         }
         $parsedValue = $this->parseUlidValue($rawValue);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.064, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithNonUlidProperty
  Doctrine\ODM\MongoDB\Aggregation\Builder::match(): Doctrine\ODM\MongoDB\Aggregation\Stage\MatchStage was not expected to be called.
  
  /srv/app/src/Shared/Infrastructure/Filter/Lt.php:16
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:31
  
  FAILURES!
  Tests: 1, Assertions: 0, Failures: 1.

603) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:18    [M] LogicalNot

--- Original
+++ New
@@ @@
 {
     public function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
     {
-        if (!$this->isUlidProperty($property) || !is_string($rawValue)) {
+        if (!$this->isUlidProperty($property) || is_string($rawValue)) {
             return;
         }
         $parsedValue = $this->parseUlidValue($rawValue);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.059, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithNonStringValue
  TypeError: App\Shared\Infrastructure\Filter\UlidFilterProcessor::parseUlidValue(): Argument #1 ($value) must be of type string, int given, called in /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php on line 15
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:22
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:15
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:42
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

604) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:18    [M] LogicalOr

--- Original
+++ New
@@ @@
 {
     public function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
     {
-        if (!$this->isUlidProperty($property) || !is_string($rawValue)) {
+        if (!$this->isUlidProperty($property) && !is_string($rawValue)) {
             return;
         }
         $parsedValue = $this->parseUlidValue($rawValue);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithNonUlidProperty
  Doctrine\ODM\MongoDB\Aggregation\Builder::match(): Doctrine\ODM\MongoDB\Aggregation\Stage\MatchStage was not expected to be called.
  
  /srv/app/src/Shared/Infrastructure/Filter/Lt.php:16
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:31
  
  FAILURES!
  Tests: 1, Assertions: 0, Failures: 1.

605) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:18    [M] LogicalOrAllSubExprNegation

--- Original
+++ New
@@ @@
 {
     public function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
     {
-        if (!$this->isUlidProperty($property) || !is_string($rawValue)) {
+        if ($this->isUlidProperty($property) || is_string($rawValue)) {
             return;
         }
         $parsedValue = $this->parseUlidValue($rawValue);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

606) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:18    [M] LogicalOrNegation

--- Original
+++ New
@@ @@
 {
     public function process(string $property, string $operator, mixed $rawValue, Builder $builder) : void
     {
-        if (!$this->isUlidProperty($property) || !is_string($rawValue)) {
+        if (!(!$this->isUlidProperty($property) || !is_string($rawValue))) {
             return;
         }
         $parsedValue = $this->parseUlidValue($rawValue);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.056, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithNonUlidProperty
  Doctrine\ODM\MongoDB\Aggregation\Builder::match(): Doctrine\ODM\MongoDB\Aggregation\Stage\MatchStage was not expected to be called.
  
  /srv/app/src/Shared/Infrastructure/Filter/Lt.php:16
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:31
  
  FAILURES!
  Tests: 1, Assertions: 0, Failures: 1.

607) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $parsedValue = $this->parseUlidValue($rawValue);
-        $this->applyOperator($operator, $parsedValue, $property, $builder);
+        
     }
     private function isUlidProperty(string $property) : bool
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

608) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:34    [M] IfNegation

--- Original
+++ New
@@ @@
     }
     private function parseUlidValue(string $value) : Ulid|array|null
     {
-        if (str_contains($value, '..')) {
+        if (!str_contains($value, '..')) {
             $parts = explode('..', $value, 2);
             $min = new Ulid(trim($parts[0]));
             $max = new Ulid(trim($parts[1]));

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Undefined array key 1
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:27
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:15
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
