609) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function parseUlidValue(string $value) : Ulid|array|null
     {
         if (str_contains($value, '..')) {
-            $parts = explode('..', $value, 2);
+            $parts = explode('..', $value, 1);
             $min = new Ulid(trim($parts[0]));
             $max = new Ulid(trim($parts[1]));
             return [$min, $max];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.067, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithUlidRange
  Undefined array key 1
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:27
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:15
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:64
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

610) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:35    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function parseUlidValue(string $value) : Ulid|array|null
     {
         if (str_contains($value, '..')) {
-            $parts = explode('..', $value, 2);
+            $parts = explode('..', $value, 3);
             $min = new Ulid(trim($parts[0]));
             $max = new Ulid(trim($parts[1]));
             return [$min, $max];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

611) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         if (str_contains($value, '..')) {
             $parts = explode('..', $value, 2);
-            $min = new Ulid(trim($parts[0]));
+            $min = new Ulid(trim($parts[1]));
             $max = new Ulid(trim($parts[1]));
             return [$min, $max];
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.056, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

612) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     {
         if (str_contains($value, '..')) {
             $parts = explode('..', $value, 2);
-            $min = new Ulid(trim($parts[0]));
+            $min = new Ulid($parts[0]);
             $max = new Ulid(trim($parts[1]));
             return [$min, $max];
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

613) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (str_contains($value, '..')) {
             $parts = explode('..', $value, 2);
             $min = new Ulid(trim($parts[0]));
-            $max = new Ulid(trim($parts[1]));
+            $max = new Ulid(trim($parts[0]));
             return [$min, $max];
         }
         return new Ulid($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.061, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

614) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37    [M] UnwrapTrim

--- Original
+++ New
@@ @@
         if (str_contains($value, '..')) {
             $parts = explode('..', $value, 2);
             $min = new Ulid(trim($parts[0]));
-            $max = new Ulid(trim($parts[1]));
+            $max = new Ulid($parts[1]);
             return [$min, $max];
         }
         return new Ulid($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

615) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (str_contains($value, '..')) {
             $parts = explode('..', $value, 2);
             $min = new Ulid(trim($parts[0]));
-            $max = new Ulid(trim($parts[1]));
+            $max = new Ulid(trim($parts[2]));
             return [$min, $max];
         }
         return new Ulid($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.059, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithUlidRange
  Undefined array key 2
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:27
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:15
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:64
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

616) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $parts = explode('..', $value, 2);
             $min = new Ulid(trim($parts[0]));
             $max = new Ulid(trim($parts[1]));
-            return [$min, $max];
+            return [$max];
         }
         return new Ulid($value);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithUlidRange
  Undefined array key 1
  
  /srv/app/src/Shared/Infrastructure/Filter/Between.php:17
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:37
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:64
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

617) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:40    [M] NewObject

--- Original
+++ New
@@ @@
             $max = new Ulid(trim($parts[1]));
             return [$min, $max];
         }
-        return new Ulid($value);
+        new Ulid($value);
+        return null;
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.052, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  TypeError: App\Shared\Infrastructure\Filter\UlidFilterProcessor::applyOperator(): Argument #2 ($filterValue) must be of type App\Shared\Domain\ValueObject\Ulid|array, null given, called in /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php on line 16
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:33
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

618) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:49    [M] Concat

--- Original
+++ New
@@ @@
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {
-        $class = __NAMESPACE__ . '\\' . ucfirst($operator);
+        $class = '\\' . __NAMESPACE__ . ucfirst($operator);
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
         $operatorStrategy->apply($builder, $field, $filterValue);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Error: Class "\App\Shared\Infrastructure\FilterLt" not found
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

619) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {
-        $class = __NAMESPACE__ . '\\' . ucfirst($operator);
+        $class = '\\' . ucfirst($operator);
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
         $operatorStrategy->apply($builder, $field, $filterValue);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Error: Class "\Lt" not found
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

620) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {
-        $class = __NAMESPACE__ . '\\' . ucfirst($operator);
+        $class = __NAMESPACE__ . ucfirst($operator);
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
         $operatorStrategy->apply($builder, $field, $filterValue);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.058, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Error: Class "App\Shared\Infrastructure\FilterLt" not found
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

621) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:49    [M] UnwrapUcFirst

--- Original
+++ New
@@ @@
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {
-        $class = __NAMESPACE__ . '\\' . ucfirst($operator);
+        $class = __NAMESPACE__ . '\\' . $operator;
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
         $operatorStrategy->apply($builder, $field, $filterValue);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Error: Class "App\Shared\Infrastructure\Filter\lt" not found
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

622) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {
-        $class = __NAMESPACE__ . '\\' . ucfirst($operator);
+        $class = __NAMESPACE__ . '\\';
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
         $operatorStrategy->apply($builder, $field, $filterValue);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Error: Class "App\Shared\Infrastructure\Filter\" not found
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

623) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:49    [M] Concat

--- Original
+++ New
@@ @@
     }
     private function applyOperator(string $operator, Ulid|array $filterValue, string $field, Builder $builder) : void
     {
-        $class = __NAMESPACE__ . '\\' . ucfirst($operator);
+        $class = __NAMESPACE__ . ucfirst($operator) . '\\';
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
         $operatorStrategy->apply($builder, $field, $filterValue);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Error: Class "App\Shared\Infrastructure\FilterLt\" not found
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:36
  /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:16
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidFilterProcessorTest.php:52
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

624) /srv/app/src/Shared/Infrastructure/Filter/UlidFilterProcessor.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $class = __NAMESPACE__ . '\\' . ucfirst($operator);
         /** @var OperatorStrategyInterface $operatorStrategy */
         $operatorStrategy = new $class();
-        $operatorStrategy->apply($builder, $field, $filterValue);
+        
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.063, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidFilterProcessorTest::testProcessWithValidUlid
  Expectation failed for method name is "match" when invoked 1 time(s).
  Method was expected to be called 1 times, actually called 0 times.
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

625) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getDescription(string $resourceClass) : array
     {
-        $operators = ['lt', 'lte', 'gt', 'gte', 'between'];
+        $operators = ['lte', 'gt', 'gte', 'between'];
         $keys = array_keys($this->properties);
         return array_merge(...array_map(static fn(string $property): array => self::buildDescriptionForProperty($property, $operators), $keys));
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.061, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Failed asserting that an array has the key 'ulid[lt]'.
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:65
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

626) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:23    [M] UnwrapArrayKeys

--- Original
+++ New
@@ @@
     public function getDescription(string $resourceClass) : array
     {
         $operators = ['lt', 'lte', 'gt', 'gte', 'between'];
-        $keys = array_keys($this->properties);
+        $keys = $this->properties;
         return array_merge(...array_map(static fn(string $property): array => self::buildDescriptionForProperty($property, $operators), $keys));
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.061, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  TypeError: App\Shared\Infrastructure\Filter\UlidRangeFilter::App\Shared\Infrastructure\Filter\{closure}(): Argument #1 ($property) must be of type string, null given
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:20
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:63
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

627) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:26    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
     {
         $operators = ['lt', 'lte', 'gt', 'gte', 'between'];
         $keys = array_keys($this->properties);
-        return array_merge(...array_map(static fn(string $property): array => self::buildDescriptionForProperty($property, $operators), $keys));
+        return array_merge(...$keys);
     }
     /**
      * @param array<string, string> $context

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.060, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  TypeError: array_merge(): Argument #1 must be of type array, string given
  
  /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:20
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:63
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

628) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:51    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $ulidFilterProcessor = new UlidFilterProcessor();
         $denormProp = $this->denormalizePropertyName($property);
-        if (!$this->isFilterableProperty($denormProp, $resourceClass)) {
+        if ($this->isFilterableProperty($denormProp, $resourceClass)) {
             return;
         }
         $values = is_array($value) ? $value : [$value];

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.059, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

629) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:55    [M] Ternary

--- Original
+++ New
@@ @@
         if (!$this->isFilterableProperty($denormProp, $resourceClass)) {
             return;
         }
-        $values = is_array($value) ? $value : [$value];
+        $values = is_array($value) ? [$value] : $value;
         foreach ($values as $operator => $rawValue) {
             $ulidFilterProcessor->process($denormProp, (string) $operator, $rawValue, $aggregationBuilder);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.054, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

630) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if (!$this->isFilterableProperty($denormProp, $resourceClass)) {
             return;
         }
-        $values = is_array($value) ? $value : [$value];
+        $values = is_array($value) ? $value : [];
         foreach ($values as $operator => $rawValue) {
             $ulidFilterProcessor->process($denormProp, (string) $operator, $rawValue, $aggregationBuilder);
         }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

631) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:56    [M] Foreach_

--- Original
+++ New
@@ @@
             return;
         }
         $values = is_array($value) ? $value : [$value];
-        foreach ($values as $operator => $rawValue) {
+        foreach (array() as $operator => $rawValue) {
             $ulidFilterProcessor->process($denormProp, (string) $operator, $rawValue, $aggregationBuilder);
         }
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

632) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $values = is_array($value) ? $value : [$value];
         foreach ($values as $operator => $rawValue) {
-            $ulidFilterProcessor->process($denormProp, (string) $operator, $rawValue, $aggregationBuilder);
+            
         }
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.060, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

633) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:59    [M] CastString

--- Original
+++ New
@@ @@
         }
         $values = is_array($value) ? $value : [$value];
         foreach ($values as $operator => $rawValue) {
-            $ulidFilterProcessor->process($denormProp, (string) $operator, $rawValue, $aggregationBuilder);
+            $ulidFilterProcessor->process($denormProp, $operator, $rawValue, $aggregationBuilder);
         }
     }
     /**

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

634) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:75    [M] UnwrapArrayCombine

--- Original
+++ New
@@ @@
      */
     private static function buildDescriptionForProperty(string $property, array $operators) : array
     {
-        return array_combine(array_map(static fn(string $op): string => sprintf('%s[%s]', $property, $op), $operators), array_map(static fn(string $op): array => self::buildOperatorDescription($property, $op), $operators));
+        return array_map(static fn(string $op): string => sprintf('%s[%s]', $property, $op), $operators);
     }
     /**
      * @return array<string, string|bool>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Failed asserting that an array has the key 'ulid[lt]'.
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:65
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

635) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:75    [M] UnwrapArrayCombine

--- Original
+++ New
@@ @@
      */
     private static function buildDescriptionForProperty(string $property, array $operators) : array
     {
-        return array_combine(array_map(static fn(string $op): string => sprintf('%s[%s]', $property, $op), $operators), array_map(static fn(string $op): array => self::buildOperatorDescription($property, $op), $operators));
+        return array_map(static fn(string $op): array => self::buildOperatorDescription($property, $op), $operators);
     }
     /**
      * @return array<string, string|bool>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Failed asserting that an array has the key 'ulid[lt]'.
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:65
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

636) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:76    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
      */
     private static function buildDescriptionForProperty(string $property, array $operators) : array
     {
-        return array_combine(array_map(static fn(string $op): string => sprintf('%s[%s]', $property, $op), $operators), array_map(static fn(string $op): array => self::buildOperatorDescription($property, $op), $operators));
+        return array_combine($operators, array_map(static fn(string $op): array => self::buildOperatorDescription($property, $op), $operators));
     }
     /**
      * @return array<string, string|bool>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.061, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Failed asserting that an array has the key 'ulid[lt]'.
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:65
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.
