637) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:82    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
      */
     private static function buildDescriptionForProperty(string $property, array $operators) : array
     {
-        return array_combine(array_map(static fn(string $op): string => sprintf('%s[%s]', $property, $op), $operators), array_map(static fn(string $op): array => self::buildOperatorDescription($property, $op), $operators));
+        return array_combine(array_map(static fn(string $op): string => sprintf('%s[%s]', $property, $op), $operators), $operators);
     }
     /**
      * @return array<string, string|bool>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.065, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  TypeError: App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::assertDescriptionContent(): Argument #1 ($description) must be of type array, string given, called in /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php on line 71
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:330
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:71
  
  ERRORS!
  Tests: 1, Assertions: 5, Errors: 1.

638) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:98    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private static function buildOperatorDescription(string $property, string $operator) : array
     {
-        return ['property' => $property, 'type' => 'string', 'required' => false, 'description' => sprintf('Filter on the %s property using the %s operator', $property, $operator)];
+        return ['type' => 'string', 'required' => false, 'description' => sprintf('Filter on the %s property using the %s operator', $property, $operator)];
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Undefined array key "property"
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:332
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:71
  
  ERRORS!
  Tests: 1, Assertions: 5, Errors: 1.

639) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:101    [M] FalseValue

--- Original
+++ New
@@ @@
      */
     private static function buildOperatorDescription(string $property, string $operator) : array
     {
-        return ['property' => $property, 'type' => 'string', 'required' => false, 'description' => sprintf('Filter on the %s property using the %s operator', $property, $operator)];
+        return ['property' => $property, 'type' => 'string', 'required' => true, 'description' => sprintf('Filter on the %s property using the %s operator', $property, $operator)];
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  F
  
  Time: 00:00.062, Memory: 16.00 MB
  
  There was 1 failure:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Failed asserting that true is false.
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:334
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:71
  
  FAILURES!
  Tests: 1, Assertions: 8, Failures: 1.

640) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:102    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private static function buildOperatorDescription(string $property, string $operator) : array
     {
-        return ['property' => $property, 'type' => 'string', 'required' => false, 'description' => sprintf('Filter on the %s property using the %s operator', $property, $operator)];
+        return ['property' => $property, 'type' => 'string', 'required' => false, 'description' > sprintf('Filter on the %s property using the %s operator', $property, $operator)];
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testGetDescription
  Undefined array key "description"
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:337
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:71
  
  ERRORS!
  Tests: 1, Assertions: 8, Errors: 1.

641) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:114    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {
-        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
+        return !$this->isPropertyEnabled($property, $resourceClass) && !$this->isPropertyMapped($property, $resourceClass, true);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.055, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

642) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:114    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {
-        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
+        return $this->isPropertyEnabled($property, $resourceClass) || $this->isPropertyMapped($property, $resourceClass, true);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.049, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

643) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:114    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {
-        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
+        return !($this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true));
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.051, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

644) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:114    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {
-        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
+        return !$this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.057, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

645) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:114    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {
-        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
+        return $this->isPropertyEnabled($property, $resourceClass) && !$this->isPropertyMapped($property, $resourceClass, true);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.053, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

646) /srv/app/src/Shared/Infrastructure/Filter/UlidRangeFilter.php:115    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     private function isFilterableProperty(string $property, string $resourceClass) : bool
     {
-        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, true);
+        return $this->isPropertyEnabled($property, $resourceClass) && $this->isPropertyMapped($property, $resourceClass, false);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.050, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Filter\UlidRangeFilterTest::testApplyWithSingleValue
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Filter\UlidRangeFilter" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:371
  /srv/app/tests/Unit/Shared/Infrastructure/Filter/UlidRangeFilterTest.php:83
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

647) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function __construct(private UlidFactory $ulidFactory)
     {
     }
-    public function toDatabaseValue(mixed $value) : ?Binary
+    protected function toDatabaseValue(mixed $value) : ?Binary
     {
         if ($value === null) {
             return null;

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

649) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:24    [M] LogicalNot

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if (is_string($value) && !SymfonyUlid::isValid($value)) {
+        if (is_string($value) && SymfonyUlid::isValid($value)) {
             return null;
         }
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

650) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:24    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if (is_string($value) && !SymfonyUlid::isValid($value)) {
+        if (is_string($value) || !SymfonyUlid::isValid($value)) {
             return null;
         }
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

651) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:24    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if (is_string($value) && !SymfonyUlid::isValid($value)) {
+        if (!(is_string($value) && !SymfonyUlid::isValid($value))) {
             return null;
         }
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

652) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:24    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if (is_string($value) && !SymfonyUlid::isValid($value)) {
+        if (!is_string($value) && SymfonyUlid::isValid($value)) {
             return null;
         }
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

653) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:24    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if (is_string($value) && !SymfonyUlid::isValid($value)) {
+        if (!is_string($value) && !SymfonyUlid::isValid($value)) {
             return null;
         }
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.037, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

654) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:28    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if (is_string($value) && !SymfonyUlid::isValid($value)) {
             return null;
         }
-        $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);
+        $ulid = true ? $value : $this->ulidFactory->create($value);
         return new Binary($ulid->toBinary(), Binary::TYPE_GENERIC);
     }
     public function toPhpValue(mixed $binary) : ?Ulid

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.041, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

655) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:28    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if (is_string($value) && !SymfonyUlid::isValid($value)) {
             return null;
         }
-        $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);
+        $ulid = false ? $value : $this->ulidFactory->create($value);
         return new Binary($ulid->toBinary(), Binary::TYPE_GENERIC);
     }
     public function toPhpValue(mixed $binary) : ?Ulid

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.044, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

656) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:28    [M] Ternary

--- Original
+++ New
@@ @@
         if (is_string($value) && !SymfonyUlid::isValid($value)) {
             return null;
         }
-        $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);
+        $ulid = $value instanceof Ulid ? $this->ulidFactory->create($value) : $value;
         return new Binary($ulid->toBinary(), Binary::TYPE_GENERIC);
     }
     public function toPhpValue(mixed $binary) : ?Ulid

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.040, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

657) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:32    [M] NewObject

--- Original
+++ New
@@ @@
             return null;
         }
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);
-        return new Binary($ulid->toBinary(), Binary::TYPE_GENERIC);
+        new Binary($ulid->toBinary(), Binary::TYPE_GENERIC);
+        return null;
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.035, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

658) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $ulid = $value instanceof Ulid ? $value : $this->ulidFactory->create($value);
         return new Binary($ulid->toBinary(), Binary::TYPE_GENERIC);
     }
-    public function toPhpValue(mixed $binary) : ?Ulid
+    protected function toPhpValue(mixed $binary) : ?Ulid
     {
         $symfonyUlid = $binary instanceof SymfonyUlid ? $binary : SymfonyUlid::fromBinary($binary);
         return $this->transformFromSymfonyUlid($symfonyUlid);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

659) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:37    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {
-        $symfonyUlid = $binary instanceof SymfonyUlid ? $binary : SymfonyUlid::fromBinary($binary);
+        $symfonyUlid = true ? $binary : SymfonyUlid::fromBinary($binary);
         return $this->transformFromSymfonyUlid($symfonyUlid);
     }
     public function transformFromSymfonyUlid(SymfonyUlid $symfonyUlid) : Ulid

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.034, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

660) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:37    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {
-        $symfonyUlid = $binary instanceof SymfonyUlid ? $binary : SymfonyUlid::fromBinary($binary);
+        $symfonyUlid = false ? $binary : SymfonyUlid::fromBinary($binary);
         return $this->transformFromSymfonyUlid($symfonyUlid);
     }
     public function transformFromSymfonyUlid(SymfonyUlid $symfonyUlid) : Ulid

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

661) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:37    [M] Ternary

--- Original
+++ New
@@ @@
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {
-        $symfonyUlid = $binary instanceof SymfonyUlid ? $binary : SymfonyUlid::fromBinary($binary);
+        $symfonyUlid = $binary instanceof SymfonyUlid ? SymfonyUlid::fromBinary($binary) : $binary;
         return $this->transformFromSymfonyUlid($symfonyUlid);
     }
     public function transformFromSymfonyUlid(SymfonyUlid $symfonyUlid) : Ulid

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

662) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $symfonyUlid = $binary instanceof SymfonyUlid ? $binary : SymfonyUlid::fromBinary($binary);
         return $this->transformFromSymfonyUlid($symfonyUlid);
     }
-    public function transformFromSymfonyUlid(SymfonyUlid $symfonyUlid) : Ulid
+    protected function transformFromSymfonyUlid(SymfonyUlid $symfonyUlid) : Ulid
     {
         return $this->ulidFactory->create((string) $symfonyUlid);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.045, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Command\CreateCustomerCommandTest::testConstructorAcceptsCustomer
  Error: Call to protected method App\Shared\Infrastructure\Transformer\UlidTransformer::transformFromSymfonyUlid() from scope App\Tests\Unit\Customer\Application\Command\CreateCustomerCommandTest
  
  /srv/app/tests/Unit/Customer/Application/Command/CreateCustomerCommandTest.php:79
  /srv/app/tests/Unit/Customer/Application/Command/CreateCustomerCommandTest.php:32
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

663) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:46    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function transformFromSymfonyUlid(SymfonyUlid $symfonyUlid) : Ulid
     {
-        return $this->ulidFactory->create((string) $symfonyUlid);
+        return $this->ulidFactory->create($symfonyUlid);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Application\Command\CreateCustomerCommandTest::testConstructorAcceptsCustomer
  TypeError: App\Shared\Infrastructure\Factory\UlidFactory::create(): Argument #1 ($ulid) must be of type string, Symfony\Component\Uid\Ulid given, called in /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php on line 33
  
  /srv/app/src/Shared/Infrastructure/Factory/UlidFactory.php:12
  /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:33
  /srv/app/tests/Unit/Customer/Application/Command/CreateCustomerCommandTest.php:79
  /srv/app/tests/Unit/Customer/Application/Command/CreateCustomerCommandTest.php:32
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

1) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @param T $entity
      */
-    public function save(object $entity) : void
+    protected function save(object $entity) : void
     {
         $this->documentManager->persist($entity);
         $this->documentManager->flush();

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  
  Fatal error: Access level to App\Core\Customer\Infrastructure\Repository\BaseRepository::save() must be public (as in class App\Core\Customer\Domain\Repository\TypeRepositoryInterface) in /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php on line 21

2) /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @param T $entity
      */
-    public function delete(object $entity) : void
+    protected function delete(object $entity) : void
     {
         $this->documentManager->remove($entity);
         $this->documentManager->flush();

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  
  Fatal error: Access level to App\Core\Customer\Infrastructure\Repository\BaseRepository::delete() must be public (as in class App\Core\Customer\Domain\Repository\TypeRepositoryInterface) in /srv/app/src/Core/Customer/Infrastructure/Repository/BaseRepository.php on line 31


Syntax Errors mutants:
======================

Not Covered mutants:
====================
