418) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeCreateRequestFactory.php:14    [M] DecrementInteger

--- Original
+++ New
@@ @@
 use App\Shared\Application\OpenApi\Builder\RequestBuilder;
 final class TypeCreateRequestFactory extends CustomerTypeRequestFactory
 {
-    public function __construct(private RequestBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
+    public function __construct(private RequestBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 254)
     {
         parent::__construct($defaultValue, $maxLength);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.036, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

419) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeCreateRequestFactory.php:14    [M] IncrementInteger

--- Original
+++ New
@@ @@
 use App\Shared\Application\OpenApi\Builder\RequestBuilder;
 final class TypeCreateRequestFactory extends CustomerTypeRequestFactory
 {
-    public function __construct(private RequestBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
+    public function __construct(private RequestBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 256)
     {
         parent::__construct($defaultValue, $maxLength);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.046, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
