127) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:97    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->status = $status;
     }
-    public function getCreatedAt() : DateTimeImmutable
+    protected function getCreatedAt() : DateTimeImmutable
     {
         return $this->createdAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.026, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetCreatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getCreatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:99
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

128) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:102    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->createdAt;
     }
-    public function setCreatedAt(DateTimeImmutable $createdAt) : void
+    protected function setCreatedAt(DateTimeImmutable $createdAt) : void
     {
         $this->createdAt = $createdAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.028, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetCreatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::setCreatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:98
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

129) /srv/app/src/Core/Customer/Domain/Entity/Customer.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->createdAt = $createdAt;
     }
-    public function getUpdatedAt() : DateTimeImmutable
+    protected function getUpdatedAt() : DateTimeImmutable
     {
         return $this->updatedAt;
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.026, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Customer\Domain\Entity\CustomerTest::testGetAndSetUpdatedAt
  Error: Call to protected method App\Core\Customer\Domain\Entity\Customer::getUpdatedAt() from scope App\Tests\Unit\Customer\Domain\Entity\CustomerTest
  
  /srv/app/tests/Unit/Customer/Domain/Entity/CustomerTest.php:106
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

240) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:100    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CreateCustomerRequestFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

241) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:101    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST > $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.012, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CreateCustomerRequestFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

242) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:102    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CreateCustomerRequestFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

243) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:103    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.012, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CreateCustomerRequestFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

244) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactory.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_BAD_REQUEST => $this->badRequestResp, HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\CustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\Request\Customer\CreateCustomerRequestFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:70
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/CustomerEndpointFactoryTest.php:45
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

249) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:102    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerRequest)));
+        
     }
     private function setPatchOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

250) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:106    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerRequest)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerRequest)));
     }
     private function setPatchOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

251) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:121    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->ulidWithExamplePathParam])->withRequestBody($this->updateCustomerRequest)->withResponses($mergedResponses)));
+        
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.013, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

252) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:126    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->ulidWithExamplePathParam])->withRequestBody($this->updateCustomerRequest)->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([])->withRequestBody($this->updateCustomerRequest)->withResponses($mergedResponses)));
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

253) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:137    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $pathItem = $this->getPathItem($openApi);
         $operationDelete = $pathItem->getDelete();
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withDelete($operationDelete->withParameters([$this->ulidWithExamplePathParam])->withResponses($this->getDeleteResponses())));
+        
     }
     private function setGetOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.010, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

254) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:140    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $pathItem = $this->getPathItem($openApi);
         $operationDelete = $pathItem->getDelete();
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withDelete($operationDelete->withParameters([$this->ulidWithExamplePathParam])->withResponses($this->getDeleteResponses())));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withDelete($operationDelete->withParameters([])->withResponses($this->getDeleteResponses())));
     }
     private function setGetOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.010, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

255) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:153    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationGet = $pathItem->getGet();
         $mergedResponses = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withGet($operationGet->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)));
+        
     }
     private function getPathItem(OpenApi $openApi) : PathItem
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

256) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:155    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationGet = $pathItem->getGet();
         $mergedResponses = $this->mergeResponses($operationGet->getResponses(), $this->getGetResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withGet($operationGet->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withGet($operationGet->withParameters([])->withResponses($mergedResponses)));
     }
     private function getPathItem(OpenApi $openApi) : PathItem
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

263) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:185    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

264) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:186    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

265) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:187    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

266) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:188    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND > $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
