267) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactory.php:189    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custNotFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Customer\ParamCustomerEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustomerFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:77
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Customer/ParamCustomerEndpointFactoryTest.php:60
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

291) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:100    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->ulidWithExamplePathParam])->withRequestBody($this->updateCustomerStatusRequest)->withResponses($mergedResponses)));
+        
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

292) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:105    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->ulidWithExamplePathParam])->withRequestBody($this->updateCustomerStatusRequest)->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([])->withRequestBody($this->updateCustomerStatusRequest)->withResponses($mergedResponses)));
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.013, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

293) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerStatusRequest)));
+        
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

294) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:124    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerStatusRequest)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerStatusRequest)));
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.010, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

305) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:182    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

306) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:183    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

307) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:184    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

308) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:185    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND > $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

309) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerStatus/ParamCStEndpointFactory.php:186    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->notFoundResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.015, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Status\ParamEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustSt" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Status/ParamEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

333) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:100    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->ulidWithExamplePathParam])->withRequestBody($this->updateCustomerTypeRequest)->withResponses($mergedResponses)));
+        
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

334) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:105    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPatch = $pathItem->getPatch();
         $mergedResponses = $this->mergeResponses($operationPatch->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([$this->ulidWithExamplePathParam])->withRequestBody($this->updateCustomerTypeRequest)->withResponses($mergedResponses)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPatch($operationPatch->withParameters([])->withRequestBody($this->updateCustomerTypeRequest)->withResponses($mergedResponses)));
     }
     private function setPutOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

335) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerTypeRequest)));
+        
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.013, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

336) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:124    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $pathItem = $this->getPathItem($openApi);
         $operationPut = $pathItem->getPut();
         $mergedResponses = $this->mergeResponses($operationPut->getResponses(), $this->getUpdateResponses());
-        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([$this->ulidWithExamplePathParam])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerTypeRequest)));
+        $openApi->getPaths()->addPath(self::ENDPOINT_URI, $pathItem->withPut($operationPut->withParameters([])->withResponses($mergedResponses)->withRequestBody($this->replaceCustomerTypeRequest)));
     }
     private function setDeleteOperation(OpenApi $openApi) : void
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

347) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:187    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

348) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:188    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED > $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.012, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

349) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:189    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN > $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.016, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

350) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:190    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND > $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.011, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

351) /srv/app/src/Shared/Application/OpenApi/Factory/Endpoint/CustomerType/ParamCTyEndpointFactory.php:191    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     private function getGetResponses() : array
     {
-        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR => $this->internalResp];
+        return [HttpResponse::HTTP_UNAUTHORIZED => $this->unauthorizedResp, HttpResponse::HTTP_FORBIDDEN => $this->forbiddenResp, HttpResponse::HTTP_NOT_FOUND => $this->custTyNFResp, HttpResponse::HTTP_INTERNAL_SERVER_ERROR > $this->internalResp];
     }
     /**
      * @return array<int,Response>

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.010, Memory: 14.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Endpoint\Type\ParamCustomerTypeEndpointFactoryTest::testCreateEndpoint
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Factory\UriParameter\UuidUriCustTy" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:79
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Endpoint/Type/ParamCustomerTypeEndpointFactoryTest.php:62
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
