376) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:73    [M] Concat

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 255);
+        return new Parameter('type', 'iri-reference', self::DEFAULT_CUSTOMER_TYPE_ID . '/api/customer_types/', 255);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.023, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

377) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:73    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 255);
+        return new Parameter('type', 'iri-reference', self::DEFAULT_CUSTOMER_TYPE_ID, 255);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

378) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:73    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 255);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/', 255);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

379) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:74    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 255);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 254);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.021, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

380) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:74    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getTypeParam() : Parameter
     {
-        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 255);
+        return new Parameter('type', 'iri-reference', '/api/customer_types/' . self::DEFAULT_CUSTOMER_TYPE_ID, 256);
     }
     protected function getStatusParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.025, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

382) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:83    [M] Concat

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 255);
+        return new Parameter('status', 'iri-reference', self::DEFAULT_CUSTOMER_STATUS_ID . '/api/customer_statuses/', 255);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

383) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:83    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 255);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/', 255);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

384) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:83    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 255);
+        return new Parameter('status', 'iri-reference', self::DEFAULT_CUSTOMER_STATUS_ID, 255);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.029, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

385) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:84    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 255);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 254);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.029, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

386) /srv/app/src/Shared/Application/OpenApi/Factory/Request/Customer/CustomerRequestFactory.php:84    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     protected function getStatusParam() : Parameter
     {
-        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 255);
+        return new Parameter('status', 'iri-reference', '/api/customer_statuses/' . self::DEFAULT_CUSTOMER_STATUS_ID, 256);
     }
     protected function getInitialsParam() : Parameter
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.026, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Customer\CreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Customer/CreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

418) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeCreateRequestFactory.php:14    [M] DecrementInteger

--- Original
+++ New
@@ @@
 use App\Shared\Application\OpenApi\Builder\RequestBuilderInterface;
 final class TypeCreateRequestFactory extends CustomerTypeRequestFactory
 {
-    public function __construct(private RequestBuilderInterface $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
+    public function __construct(private RequestBuilderInterface $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 254)
     {
         parent::__construct($defaultValue, $maxLength);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.020, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

419) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeCreateRequestFactory.php:14    [M] IncrementInteger

--- Original
+++ New
@@ @@
 use App\Shared\Application\OpenApi\Builder\RequestBuilderInterface;
 final class TypeCreateRequestFactory extends CustomerTypeRequestFactory
 {
-    public function __construct(private RequestBuilderInterface $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
+    public function __construct(private RequestBuilderInterface $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 256)
     {
         parent::__construct($defaultValue, $maxLength);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.024, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

420) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeCreateRequestFactory.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function __construct(private RequestBuilderInterface $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
     {
-        parent::__construct($defaultValue, $maxLength);
+        
     }
     protected function getRequestBuilder() : RequestBuilderInterface
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.023, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeCreateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeCreateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

421) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeUpdateRequestFactory.php:15    [M] IncrementInteger

--- Original
+++ New
@@ @@
 use App\Shared\Application\OpenApi\Builder\RequestPatchBuilder;
 final class TypeUpdateRequestFactory extends CustomerTypeRequestFactory
 {
-    public function __construct(private RequestPatchBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
+    public function __construct(private RequestPatchBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 256)
     {
         parent::__construct($defaultValue, $maxLength);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.031, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeUpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeUpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

422) /srv/app/src/Shared/Application/OpenApi/Factory/Request/CustomerType/TypeUpdateRequestFactory.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
 use App\Shared\Application\OpenApi\Builder\RequestPatchBuilder;
 final class TypeUpdateRequestFactory extends CustomerTypeRequestFactory
 {
-    public function __construct(private RequestPatchBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 255)
+    public function __construct(private RequestPatchBuilder $requestBuilder, string $defaultValue = 'Prospect', int $maxLength = 254)
     {
         parent::__construct($defaultValue, $maxLength);
     }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E                                                                   1 / 1 (100%)
  
  Time: 00:00.032, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Application\OpenApi\Factory\Request\Type\TypeUpdateFactoryTest::testGetRequest
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Application\OpenApi\Builder\RequestPatchBuilder" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Application/OpenApi/Factory/Request/Type/TypeUpdateFactoryTest.php:16
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

659) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:24    [M] IfNegation

--- Original
+++ New
@@ @@
         if ($value === null) {
             return null;
         }
-        if ($this->isInvalidString($value)) {
+        if (!$this->isInvalidString($value)) {
             return null;
         }
         if (!$value instanceof Ulid) {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.024, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

660) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:28    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($this->isInvalidString($value)) {
             return null;
         }
-        if (!$value instanceof Ulid) {
+        if (!true) {
             $value = $this->ulidFactory->create($value);
         }
         return new Binary($value->toBinary(), Binary::TYPE_GENERIC);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.022, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

661) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:28    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if ($this->isInvalidString($value)) {
             return null;
         }
-        if (!$value instanceof Ulid) {
+        if (!false) {
             $value = $this->ulidFactory->create($value);
         }
         return new Binary($value->toBinary(), Binary::TYPE_GENERIC);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

662) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
         if ($this->isInvalidString($value)) {
             return null;
         }
-        if (!$value instanceof Ulid) {
+        if ($value instanceof Ulid) {
             $value = $this->ulidFactory->create($value);
         }
         return new Binary($value->toBinary(), Binary::TYPE_GENERIC);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.021, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

663) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:32    [M] NewObject

--- Original
+++ New
@@ @@
         if (!$value instanceof Ulid) {
             $value = $this->ulidFactory->create($value);
         }
-        return new Binary($value->toBinary(), Binary::TYPE_GENERIC);
+        new Binary($value->toBinary(), Binary::TYPE_GENERIC);
+        return null;
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.031, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

665) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:37    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {
-        if ($binary instanceof SymfonyUlid) {
+        if (true) {
             return $this->transformFromSymfonyUlid($binary);
         }
         $symfonyUlid = SymfonyUlid::fromBinary($binary);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.031, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

666) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:37    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function toPhpValue(mixed $binary) : ?Ulid
     {
-        if ($binary instanceof SymfonyUlid) {
+        if (false) {
             return $this->transformFromSymfonyUlid($binary);
         }
         $symfonyUlid = SymfonyUlid::fromBinary($binary);

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.030, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

669) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:52    [M] LogicalNot

--- Original
+++ New
@@ @@
     }
     private function isInvalidString(mixed $value) : bool
     {
-        return is_string($value) && !SymfonyUlid::isValid($value);
+        return is_string($value) && SymfonyUlid::isValid($value);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.019, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

670) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:52    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     private function isInvalidString(mixed $value) : bool
     {
-        return is_string($value) && !SymfonyUlid::isValid($value);
+        return is_string($value) || !SymfonyUlid::isValid($value);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.019, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

671) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:52    [M] LogicalAndAllSubExprNegation

--- Original
+++ New
@@ @@
     }
     private function isInvalidString(mixed $value) : bool
     {
-        return is_string($value) && !SymfonyUlid::isValid($value);
+        return !is_string($value) && SymfonyUlid::isValid($value);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.021, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

672) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:52    [M] LogicalAndNegation

--- Original
+++ New
@@ @@
     }
     private function isInvalidString(mixed $value) : bool
     {
-        return is_string($value) && !SymfonyUlid::isValid($value);
+        return !(is_string($value) && !SymfonyUlid::isValid($value));
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.019, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.

673) /srv/app/src/Shared/Infrastructure/Transformer/UlidTransformer.php:52    [M] LogicalAndSingleSubExprNegation

--- Original
+++ New
@@ @@
     }
     private function isInvalidString(mixed $value) : bool
     {
-        return is_string($value) && !SymfonyUlid::isValid($value);
+        return !is_string($value) && !SymfonyUlid::isValid($value);
     }
 }

  PHPUnit 9.6.29 by Sebastian Bergmann and contributors.
  
  Testing 
  E
  
  Time: 00:00.019, Memory: 16.00 MB
  
  There was 1 error:
  
  1) App\Tests\Unit\Shared\Infrastructure\Transformer\UlidTransformerTest::testToDatabaseValueWithUlidInstance
  PHPUnit\Framework\MockObject\ClassIsFinalException: Class "App\Shared\Infrastructure\Factory\UlidFactory" is declared "final" and cannot be doubled
  
  /srv/app/tests/Unit/Shared/Infrastructure/Transformer/UlidTransformerTest.php:22
  
  ERRORS!
  Tests: 1, Assertions: 0, Errors: 1.
